{
    "intents": [
      {
        "tag": "greeting",
        "patterns": [
                      "Hello", 
                      "Hi",
                      "Hey",
                      "Good day",
                      "Greetings",
                      "What's up?",
                      "Yo",
                      "Hi there",
                      "Good morning",
                      "Good afternoon",
                      "What's up",
                      "Howdy",
                      "Hiya",
                      "Hey there",
                      "Hello there",
                      "Hi, can I get some help?",
                      "Hello, may I ask a question?",
                      "Hi, I need assistance",
                      "Hey, could you help me?",
                      "Hello, I have a query",
                      "Hi, is anyone there?",
                      "Hey, is this support?"
                    ],
        "responses": [
                      "Hello!",
                      "Hi there!",
                      "Hey! How can I assist you?",
                      "Hey",
                      "Hey, what's up?",
                      "Hi! How can I be of service?",
                      "Greetings! How may I assist you today?",
                      "Hello there!","Hi! What can I do for you?",
                      "Hey! Need any help?",
                      "Welcome! How can I help you today?",
                      "Hello, how may I be of assistance?",
                      "Hey there! What can I do to assist you?",
                      "Greetings! How may I help you?",
                      "Hi! How can I support you?",
                      "Hey! What brings you here?",
                      "Hello! How may I assist you?",
                      "Hi there! How can I be of service?",
                      "Hey! How can I assist you today?",
                      "Hello! What can I help you with?"
                      ]
      },
      {
        "tag": "goodbye",
        "patterns": [
                      "Goodbye", 
                      "See you later", 
                      "Bye",
                      "Cya",
                      "I am Leaving",
                      "Have a Good Day",
                      "Take care",
                      "Catch you later",
                      "Gotta go",
                      "Adios",
                      "Farewell",
                      "Until next time",
                      "So long",
                      "See you soon",
                      "Later",
                      "Till we meet again",
                      "Goodnight",
                      "Bye for now",
                      "Take it easy",
                      "Peace out",
                      "I'm off",
                      "Time to go",
                      "Signing off",
                      "Until later",
                      "Bye bye",
                      "I'll be back",
                      "Leaving now",
                      "Talk to you soon",
                      "Be well"
                    ],
        "responses": [
                      "Goodbye!", 
                      "See you later!", 
                      "Take care!",
                      "Farewell!",
                      "Until next time!",
                      "Have a great day!",
                      "Bye for now!",
                      "Take it easy!",
                      "Catch you later!",
                      "Adios!",
                      "Goodbye and take care!",
                      "See you soon!",
                      "Wishing you the best!"
                    ]
      },
      {
        "tag": "thanks",
        "patterns": [
                      "Thanks", 
                      "Thank you", 
                      "Appreciate it",
                      "Thankyou so much",
                      "Thanks it helped me fix the issue",
                      "Thank you very much",
                      "Many thanks",
                      "Much appreciated",
                      "Thanks a lot",
                      "Thanks a bunch",
                      "Thanks for your help",
                      "Thank you for assisting me",
                      "Thank you for your support",
                      "Thank you for the great service",
                      "Thank you for resolving my issue",
                      "I appreciate your help",
                      "I'm grateful for your assistance",
                      "You're awesome, thanks",
                      "I'm thankful for your support",
                      "You've been very helpful, thanks",
                      "I owe you one, thank you",
                      "I'm so grateful, thank you",
                      "I can't thank you enough",
                      "Thanks for everything",
                      "You're the best, thank you",
                      "Big thank you",
                      "Heartfelt thanks",
                      "Thanks a million",
                      "You've been fantastic, thank you",
                      "Thank you for being so helpful",
                      "I'm deeply grateful, thank you",
                      "You're a lifesaver, thank you",
                      "Thank you for going above and beyond",
                      "Thanks for being so responsive",
                      "Thanks for your prompt assistance"
                    ],
        "responses": [
                      "You're welcome!", 
                      "Glad I could help!", 
                      "No problem!",
                      "My pleasure!",
                      "Happy to assist!",
                      "Anytime!",
                      "It was my pleasure!",
                      "Glad to be of service!",
                      "Don't mention it!",
                      "Always here to help!",
                      "You're very welcome!",
                      "No trouble at all!",
                      "I'm here whenever you need!"
                    ]
      },
      {
        "tag": "savenest_app_do",
        "patterns": [
                      "What does savenest do?",
                      "What is this app for?",
                      "What can I do with this app?",
                      "What is the purpose of this app?",
                      "What problems does this app solve?",
                      "What benefits does this app offer?",
                      "How can this app assist me?",
                      "How does this app improve my life?",
                      "What can I expect from using this app?",
                      "What kind of data does this app manage?",
                      "What is the primary goal of this app?"
                    ],
        "responses": [
                        "Save Nest provides comprehensive finance management tools to help you track your income, expenses, and savings effectively.",
                        "Managing your finances is made easy with Save Nest, an application dedicated to tracking income, expenses, and savings.",
                        "Take control of your finances with Save Nest, a user-friendly app that assists in managing income, expenses, and savings.",
                        "With Save Nest, you can effortlessly monitor your finances, including income, expenses, and savings.",
                        "Stay on top of your financial health with Save Nest, an intuitive application designed to manage your income, expenses, and savings.",
                        "Save Nest simplifies financial management by allowing you to track your income, expenses, and savings in one convenient place.",
                        "Optimize your financial planning with Save Nest, a powerful tool for managing income, expenses, and savings.",
                        "Save Nest empowers you to efficiently manage your finances, ensuring you stay on track with your income, expenses, and savings.",
                        "Track your financial progress effortlessly with Save Nest, the ultimate solution for managing income, expenses, and savings.",
                        "Save Nest streamlines financial management tasks, offering insights into your income, expenses, and savings."
                      ]
      },
      {
        "tag": "password_reset",
        "patterns": [
                      "how do i change my password?",
                      "How can I update my password?",
                      "I forgot my password. How do I reset it?",
                      "What's the process for changing my password?",
                      "Can you guide me on changing my password?",
                      "Where do I go to change my password?",
                      "How do I set a new password?",
                      "Is there a way to modify my password?",
                      "I need to change my password. What should I do?",
                      "I want to update my password. How can I do that?",
                      "How do I edit my password?",
                      "What steps do I take to change my password?",
                      "Could you help me with resetting my password?",
                      "Where can I find the option to change my password?",
                      "What's the procedure for changing my account password?",
                      "Can you assist me in changing my password?",
                      "I need to change my login password. How do I proceed?",
                      "How do I access the password change feature?",
                      "I'm looking to change my password. Any guidance?",
                      "What's the method for changing my account password?",
                      "How do I update my login credentials?",
                      "What's the protocol for updating my password?",
                      "Do you have instructions for changing passwords?",
                      "Can you provide steps for changing my password?",
                      "I want to change my password. Where do I start?",
                      "How do I modify my login password?",
                      "What's the best way to change my password?",
                      "Where can I find the option to reset my password?"
                    ],
         "responses": [
                        "To initiate a password reset, navigate to your settings, access your profile, locate the password section, and follow the provided instructions. Don't hesitate to reach out if you require any additional help!",
                        "For resetting your password, simply head over to settings, proceed to your profile, locate the password option, and then follow the steps outlined there. If you encounter any issues, feel free to ask for assistance!",
                        "To reset your password, go to settings, then access your profile, find the password option, and proceed according to the instructions provided. If you have any questions or need further support, don't hesitate to reach out!",
                        "If you need to reset your password, go to settings, navigate to your profile, locate the password section, and follow the instructions provided. Feel free to ask if you require any additional assistance!",
                        "To reset your password, simply access settings, then proceed to your profile, locate the password option, and follow the instructions provided there. Should you require further assistance, don't hesitate to ask!",
                        "For password reset, head to settings, then your profile, locate the password section, and follow the steps provided. If you need more help, don't hesitate to ask!",
                        "To reset your password, go to settings, access your profile, find the password option, and follow the steps provided there. If you require any further assistance, feel free to reach out!",
                        "If you're looking to reset your password, navigate to settings, access your profile, locate the password section, and follow the instructions provided there. If you need additional support, just let us know!",
                        "For password reset, simply go to settings, access your profile, find the password section, and follow the steps provided. If you need any further assistance, we're here to help!",
                        "To reset your password, go to settings, then your profile, find the password section, and follow the instructions provided. Should you need any further assistance, don't hesitate to ask!"
                      ]
      },
      {
        "tag": "contacting_team",
        "patterns": [
                      "how to contact your team?",
                      "How can I reach your team?",
                      "What's the best way to get in touch with your team?",
                      "I need to contact your team. How do I do that?",
                      "Can you provide information on contacting your team?",
                      "How do I connect with your team?",
                      "I have a question. How do I contact support?",
                      "What are the contact options for your team?",
                      "Is there a way to speak with a member of your team?",
                      "How do I get assistance from your team?",
                      "How do I reach out to your customer support?",
                      "What's the process for reaching your team?",
                      "I want to talk to someone from your team. How do I do that?",
                      "Can you provide me with the contact details for your team?",
                      "I need help. How do I contact support?",
                      "What channels are available to contact your team?",
                      "How do I initiate contact with your team?",
                      "What are the available methods to contact your team?",
                      "I'm having an issue. How do I contact your team for help?",
                      "How do I get in touch with your support team?",
                      "I need assistance. How can I reach out to your team?",
                      "What's the procedure for contacting your team?",
                      "I want to speak with someone regarding an issue. How do I reach out?",
                      "Can you provide guidance on contacting your team?",
                      "I have a query. How do I contact your team?",
                      "How do I get support from your team?",
                      "What's the quickest way to contact your team?",
                      "How do I access support from your team?",
                      "I need to talk to someone about a problem. How do I contact your team?"
                    ],
        "responses":[
                    "If you need to reach out to our team, you can find our contact information on our website and app under the 'About Us' section, or feel free to reach us via email or phone.",
                    "To get in touch with our team, you can refer to the 'About Us' section on our website or in the app, where you'll find our contact details. Alternatively, you can reach us via email or phone.",
                    "Should you wish to contact our team, you can find our contact details on our website, under the 'About Us' section, or within the app. You can also reach us via email or phone.",
                    "For any inquiries or assistance, you can contact our team through the email and phone numbers provided on our website and in the 'About Us' section of the app.",
                    "To get in touch with our team, simply visit our website and check out the 'About Us' section for our contact information, or you can find it within the app. You can also reach us by email or phone.",
                    "If you need assistance or have any questions, don't hesitate to contact our team. You can find our contact details on our website under the 'About Us' section or within the app. Alternatively, you can reach us via email or phone.",
                    "To reach our team, you can refer to the contact information provided on our website's 'About Us' section or within the app. You can also reach us via email or phone for any inquiries or assistance.",
                    "For any queries or assistance, you can reach out to our team through the contact details provided on our website under the 'About Us' section or within the app. You can also contact us via email or phone.",
                    "Should you need to get in touch with our team, you can find our contact information on our website's 'About Us' section or in the app. Feel free to reach out to us via email or phone for any assistance.",
                    "If you require assistance or wish to contact our team, you can find our contact information on our website's 'About Us' section or within the app. You can also reach us via email or phone."
                  ]
      },
      {
        "tag": "budget_creating",
        "patterns": [
                    "how to create a budget",
                    "Can you guide me on creating a budget?",
                    "I need help with budget creation. How do I start?",
                    "What's the process for making a budget?",
                    "How do I begin creating a budget?",
                    "Can you provide instructions on budget creation?",
                    "Where do I start with creating a budget?",
                    "I want to learn how to create a budget. How can I do that?",
                    "Is there a step-by-step guide for creating a budget?",
                    "How can I set up a budget?",
                    "I'm looking for advice on budget creation. What should I do?",
                    "How do I draft a budget?",
                    "What are the steps involved in budget creation?",
                    "Can you help me with budget planning?"
                  ],
        "responses": [
                      "Upon your initial sign-in to the application, you'll be prompted to create a budget. If you haven't created one yet, you'll also be prompted to do so when you navigate to the add section.",
                      "When you first log in to the app, you'll be asked to set up a budget. If you haven't done so already, you'll receive a prompt to create a budget when you access the add section.",
                      "When you sign in for the first time, the app will prompt you to establish a budget. If you haven't done this yet, you'll be reminded to create a budget when you visit the add section.",
                      "During your initial login to the application, you'll be requested to set up a budget. In case you haven't done this yet, you'll receive a prompt to create a budget upon entering the add section.",
                      "Upon your initial login to the app, you'll be guided to create a budget. If you haven't completed this step, you'll be reminded to do so when you enter the add section.",
                      "When you first access the app, you'll be guided through the process of setting up a budget. If you haven't done this yet, you'll be reminded to create a budget when you enter the add section.",
                      "During your first login to the application, you'll be prompted to create a budget. If you haven't completed this step, you'll receive a reminder to create a budget when you visit the add section.",
                      "Upon your initial sign-in to the app, you'll be instructed to create a budget. If you haven't done so yet, you'll receive a reminder to create a budget when you navigate to the add section.",
                      "When you first sign in to the application, you'll be asked to establish a budget. If you haven't completed this step, you'll be reminded to create a budget when you access the add section.",
                      "During your initial sign-in to the app, you'll be prompted to create a budget. If you haven't done this yet, you'll receive a prompt to create a budget when you visit the add section."
                    ]
      },
      {
        "tag": "update_budget",
        "patterns": [
                      "how to update my budget",
                      "Can you guide me on updating my budget?",
                      "I need help with budget updates. How do I proceed?",
                      "What's the process for updating my budget?",
                      "How do I begin updating my budget?",
                      "Can you provide instructions on budget updates?",
                      "Where do I start with updating my budget?",
                      "I want to learn how to update my budget. How can I do that?",
                      "Is there a step-by-step guide for budget updates?",
                      "How can I modify my budget?",
                      "I'm looking for advice on budget updates. What should I do?",
                      "How do I adjust my budget?",
                      "What are the steps involved in updating a budget?",
                      "What's the best approach for updating my budget?",
                      "Can you help me with updating my budget?",
                      "How do I refine my budget?",
                      "I'm unsure how to start updating my budget. Can you assist?",
                      "How do I track changes to my budget?",
                      "Do you have any templates or examples for budget updates?",
                      "I want to learn more about updating my budget. Where should I begin?",
                      "Can you provide guidance on creating a personalized budget update?",
                      "How do I allocate funds effectively in an updated budget?"
                    ],
        "responses": [
                      "To update your budget manually, you can navigate to the 'Add' section in the application and select the items you wish to include. Alternatively, you can utilize our automatic feature, which employs OCR technology to update the budget automatically based on a photo of the receipt.",
                      "For manual budget updates, simply access the 'Add' section in the app and choose the items you'd like to add. Alternatively, you can take advantage of our automatic feature, which utilizes OCR technology to update the budget from a photo of the receipt.",
                      "If you prefer manual budget updates, you can do so by going to the 'Add' section within the application and selecting the items you want to include. Alternatively, you can opt for our automatic feature, which uses OCR technology to update the budget automatically from a receipt photo.",
                      "To manually update your budget, navigate to the 'Add' section in the application and select the desired items. Alternatively, you can opt for our automatic feature, which employs OCR technology to update the budget based on a photo of the receipt.",
                      "For manual budget updates, head to the 'Add' section in the application and choose the items you'd like to add to your budget. Alternatively, you can utilize our automatic feature, powered by OCR technology, to update the budget from a photo of the receipt.",
                      "If you want to update your budget manually, access the 'Add' section in the application and select the items you want to include. Alternatively, you can utilize our automatic feature, which leverages OCR technology to update the budget automatically from a photo of the receipt.",
                      "To manually update your budget, navigate to the 'Add' section in the app and select the items you'd like to add. Alternatively, you can take advantage of our automatic feature, which uses OCR technology to update the budget based on a photo of the receipt.",
                      "For manual budget updates, simply go to the 'Add' section in the application and choose the items you wish to include in your budget. Alternatively, you can use our automatic feature, powered by OCR technology, to update the budget from a photo of the receipt.",
                      "If you prefer manual budget updates, you can access the 'Add' section in the application and select the items you want to include. Alternatively, you can opt for our automatic feature, which utilizes OCR technology to update the budget automatically from a photo of the receipt.",
                      "To update your budget manually, you can go to the 'Add' section in the app and select the items you want to include. Alternatively, our automatic feature, which uses OCR technology, can update the budget from a photo of the receipt."
                    ]
      },
      {
        "tag": "delete_budget",
        "patterns": [
                      "how do i delete my budget",
                      "Can you guide me on deleting my budget?",
                      "I need help with budget deletion. How do I proceed?",
                      "What's the process for deleting my budget?",
                      "How do I begin deleting my budget?",
                      "Can you provide instructions on budget deletion?",
                      "Where do I start with deleting my budget?",
                      "I want to learn how to delete my budget. How can I do that?",
                      "Is there a step-by-step guide for budget deletion?",
                      "How can I remove my budget?",
                      "I'm looking for advice on budget deletion. What should I do?",
                      "How do I get rid of my budget?",
                      "What are the steps involved in deleting a budget?",
                      "What's the best approach for deleting my budget?",
                      "Can you help me with deleting my budget?",
                      "How do I erase my budget?",
                      "I'm interested in deleting my budget. What are the basics?",
                      "I'm unsure how to start deleting my budget. Can you assist?",
                      "What are the key components of successfully deleting a budget?",
                      "How do I confirm the deletion of my budget?",
                      "Do you have any templates or examples for budget deletion?",
                      "I want to learn more about deleting my budget. Where should I begin?",
                      "Can you provide guidance on deleting a personalized budget?"
                    ],
        "responses": [
                      "To remove a budget, navigate to the user section within the settings. There, you'll find an option labeled 'Delete Budget'.",
                      "If you wish to delete a budget, simply access the user section located in the settings. You'll then see an option specifically for deleting budgets.",
                      "To eliminate a budget, head to the user section in the settings. Look for the option labeled 'Delete Budget' to proceed.",
                      "If you want to delete a budget, go to the user section in the settings. From there, you'll find an option to delete the budget.",
                      "To delete a budget, access the user section in the settings. You'll see an option named 'Delete Budget' to help you remove it.",
                      "If you need to remove a budget, navigate to the user section within the settings. There, you'll find an option to delete the budget.",
                      "To delete a budget, go to the user section located in the settings. Look for the option titled 'Delete Budget' to proceed.",
                      "To eliminate a budget, simply access the user section within the settings. You'll then see an option specifically for deleting budgets.",
                      "If you wish to remove a budget, go to the user section in the settings. You'll find an option labeled 'Delete Budget' to assist you.",
                      "To delete a budget, access the user section in the settings. There, you'll see an option to delete the budget."
                    ]
      },
      {
        "tag": "account_details",
        "patterns": [
                      "how do i change my username",
                      "Can I change my account information",
                      "how do i change my email",
                      "How do I update my contact details?",
                      "How do I change my username?",
                      "Can I update my username?",
                      "How do I modify my account information?",
                      "How can I change my account details?",
                      "Can I change my personal information?",
                      "How do I edit my account information?",
                      "Can I change my profile details?",
                      "How do I update my user profile?",
                      "Is it possible to change my username?",
                      "How do I alter my account settings?",
                      "Can I update my account information?",
                      "How do I change my email address?",
                      "Is there a way to update my email?",
                      "Can I modify my email address?",
                      "How do I change my contact details?",
                      "Can I update my contact information?",
                      "How do I edit my email?",
                      "How can I change my email?",
                      "Is it possible to update my contact information?",
                      "How do I change my personal details?",
                      "Can I modify my account settings?",
                      "How do I update my user information?",
                      "Is there a way to change my account details?",
                      "How can I edit my account settings?"
                    ],
        "responses": [  
                      "If you wish to update your account information, simply navigate to the user section within the settings.",
                      "To modify your account details, go to the user section located in the settings.",
                      "For changing your account information, head over to the user section in the settings.",
                      "To update your account information, access the user section within the settings menu.",
                      "If you need to edit your account details, visit the user section available in the settings.",
                      "For altering your account information, navigate to the user section within the settings.",
                      "To adjust your account information, go to the user section found in the settings.",
                      "If you want to change your account details, access the user section in the settings.",
                      "To update your account information, simply go to the user section within the settings.",
                      "For modifying your account details, navigate to the user section located in the settings."
                    ]
      },
      {
        "tag": "app_price",
        "patterns": [
                      "How much does this app cost?",
                      "What is the pricing for this application?",
                      "Is there a fee for using this app?",
                      "Do I need to pay for this application?",
                      "What are the charges associated with this app?",
                      "Is there a subscription fee for this app?",
                      "What is the pricing model for this application?",
                      "Are there any costs associated with using this app?",
                      "Do I have to purchase this app?",
                      "Is this app available for free?",
                      "How expensive is this application?",
                      "What is the cost structure of this app?",
                      "Can you provide information on the pricing of this application?",
                      "Is there a one-time payment for this app?",
                      "How much do I need to pay to use this app?",
                      "Are there any hidden fees with this application?",
                      "What is the pricing plan for this app?",
                      "Does this app offer a free trial?",
                      "Is there a premium version of this app?",
                      "What payment methods are accepted for this app?",
                      "Are there any discounts available for this app?",
                      "Can I use this app for free forever?",
                      "Is there a monthly subscription for this app?",
                      "How can I get this app for free?",
                      "Is there a price tag associated with this application?",
                      "Can I test this app before purchasing?",
                      "Are there any in-app purchases in this app?",
                      "How do I pay for this app?",
                      "What is the cost of upgrading to a premium version?"
                    ],
        "responses": [
                      "Currently, there is no premium version available. Our application is completely free and offers all its features without any cost. However, we plan to introduce a premium version with additional functions in one of our upcoming updates.",
                      "At present, there isn't a premium version offered. Our application is entirely free, providing all its features to users without charge. We do intend to introduce a premium version with exclusive features in a future update.",
                      "As of now, there's no premium version of the application. It's free to use, offering all its features at no cost. However, we're planning to release a premium version with enhanced functionalities in an upcoming update.",
                      "Currently, there's no premium version available. Our application is free and offers all its features without any charges. However, we have plans to introduce a premium version with additional features in the near future.",
                      "For now, there's no premium version offered. Our application is completely free, providing all features to users without any cost. We do have plans to introduce a premium version with premium functions in a forthcoming update.",
                      "At the moment, there isn't a premium version available. Our application is free and offers all features without any fees. However, we're working on introducing a premium version with additional functions in the next update.",
                      "Currently, there's no premium version of the application. It's free to use, offering all features to users without any charges. However, we're preparing to release a premium version with advanced functionalities soon.",
                      "For now, there's no premium version available. Our application is free and provides all its features without any cost. However, we intend to introduce a premium version with premium functions in an upcoming update.",
                      "As of now, there's no premium version of the application. It's completely free, offering all features without any charges. However, we plan to introduce a premium version with additional functions in one of our future updates.",
                      "Currently, there's no premium version available. Our application is free and provides all its features for free. However, we'll be adding a premium version with premium functions in one of our upcoming updates."
                      ]
      },
      {
        "tag": "app_slow",
        "patterns": [
                      "application running slow",
                      "The app is very slow",
                      "Why is the application running so slowly?",
                      "The performance of the app is sluggish",
                      "The app is taking too long to respond",
                      "The application is not responding quickly",
                      "The app is lagging",
                      "Why does the app take so much time to load?",
                      "The application is freezing frequently",
                      "Why is the app not working smoothly?",
                      "The speed of the app is disappointing",
                      "The application is experiencing delays",
                      "Why is the app performance so poor?",
                      "The app is running at a snail's pace",
                      "The application is unresponsive",
                      "What's causing the app to be so slow?",
                      "The app is behaving sluggishly",
                      "The performance of the app is subpar",
                      "Why is the app response time so slow?",
                      "The app is not running smoothly",
                      "The application is taking forever to load",
                      "Why is the app performance degraded?",
                      "The app is running slower than usual",
                      "The application is not functioning optimally",
                      "The app is sluggish and unresponsive",
                      "The performance of the app has deteriorated",
                      "Why is the app performance inconsistent?",
                      "The application is experiencing delays and lags",
                      "The app is dragging its feet",
                      "The application is running poorly"
                    ],
        "responses": [
                      "At times, simply restarting the application can address performance issues by clearing temporary data and reloading the app. If that doesn't help, consider restarting your device to clear out temporary glitches or conflicts affecting performance. Make sure to keep the application updated, as low storage space can impact performance. Deleting unnecessary files or apps can free up space. Additionally, ensure your device's operating system is up to date, as updates may include performance improvements and bug fixes. If none of these solutions work, reaching out to the application's support team for personalized troubleshooting steps or further assistance may be necessary.",
                      "Sometimes, just restarting the application can solve performance issues by clearing temporary data and reloading the app. If that doesn't work, try restarting your device to resolve any temporary glitches or conflicts affecting performance. Keeping the application up to date is crucial, as low storage space can affect performance. Deleting unnecessary files or apps can help free up space. Also, make sure your device's operating system is up to date, as updates often include performance improvements and bug fixes. If none of these steps help, contacting the application's support team for personalized troubleshooting or further assistance may be needed.",
                      "Occasionally, simply restarting the application can resolve performance issues by clearing temporary data and reloading the app. If that doesn't work, try restarting your device to clear any temporary glitches or conflicts affecting performance. It's important to keep the application updated, as low storage space can impact performance. Deleting unnecessary files or apps can help free up space. Additionally, ensure your device's operating system is up to date, as updates may include performance improvements and bug fixes. If these steps don't resolve the issue, consider reaching out to the application's support team for personalized troubleshooting or further assistance.",
                      "In some cases, restarting the application can effectively address performance issues by clearing temporary data and reloading the app. If this doesn't help, consider restarting your device to clear temporary glitches or conflicts impacting performance. Keep the application updated to avoid performance issues caused by low storage space. Deleting unnecessary files or apps can also help free up space. Additionally, ensure your device's operating system is up to date, as updates may include performance enhancements and bug fixes. If none of these steps work, contacting the application's support team for personalized troubleshooting or further assistance may be necessary.",
                      "There are times when simply restarting the application can resolve performance issues by clearing temporary data and reloading the app. If this doesn't work, try restarting your device to clear temporary glitches or conflicts affecting performance. Keeping the application updated is important to prevent performance issues caused by low storage space. Deleting unnecessary files or apps can help free up space. Also, ensure your device's operating system is up to date, as updates may include performance improvements and bug fixes. If none of these solutions work, contacting the application's support team for personalized troubleshooting or further assistance may be necessary.",
                      "Sometimes, just restarting the application can solve performance issues by clearing temporary data and reloading the app. If this doesn't help, try restarting your device to clear temporary glitches or conflicts affecting performance. Ensure the application is kept up to date to avoid performance issues due to low storage space. Deleting unnecessary files or apps can also help free up space. Additionally, ensure your device's operating system is up to date, as updates may include performance improvements and bug fixes. If none of these steps resolve the issue, contacting the application's support team for personalized troubleshooting or further assistance may be required."
                    ]
      },
      {
        "tag": "feedback",
        "patterns": [
                      "how do i provide my feedback",
                      "Where can I leave my feedback?",
                      "How do I share my thoughts about the app?",
                      "Is there a way to provide feedback?",
                      "How can I give my input on the application?",
                      "I want to provide feedback. How do I do that?",
                      "What's the process for submitting feedback?",
                      "Can you tell me how to offer feedback?",
                      "How do I offer suggestions for improvement?",
                      "Where can I give my opinion about the app?",
                      "How do I send my feedback?",
                      "What's the best way to share my feedback?",
                      "How can I communicate my ideas for the app?",
                      "Is there a feedback form I can fill out?",
                      "I have some feedback. What should I do with it?",
                      "How do I provide comments on the app?",
                      "How do I express my satisfaction or concerns?",
                      "Can I give feedback directly through the app?",
                      "What channels are available for providing feedback?",
                      "I'd like to offer my feedback. How can I proceed?",
                      "Is there a way to report issues or suggest improvements?",
                      "Where should I go to share my experience with the app?",
                      "How do I offer constructive criticism?",
                      "Is there a feedback section in the app?",
                      "How can I give my feedback anonymously?",
                      "What's the procedure for giving feedback?",
                      "Is there a dedicated email address for feedback?",
                      "How do I contribute to the app's development?",
                      "What's the protocol for submitting feedback?",
                      "How do I voice my opinions about the app?"
                    ],
        "responses": [
                      "If you'd like to share your valuable feedback, you can do so by visiting our SaveNest website. We have a dedicated section designed specifically for collecting feedback from users like you.",
                      "To provide your valuable feedback, simply navigate to our SaveNest website. There, you'll find a dedicated section created specifically for gathering feedback from users.",
                      "For those who wish to offer their valuable feedback, we encourage you to visit our SaveNest website. You'll discover a dedicated section tailored for collecting feedback from users.",
                      "To share your valuable feedback, please visit our SaveNest website. We've created a specific section there for gathering feedback from users like yourself.",
                      "If you have valuable feedback to share, please visit our SaveNest website. We've set up a dedicated section specifically for collecting feedback from users.",
                      "For users who wish to provide their valuable feedback, we invite you to visit our SaveNest website. There, you'll find a dedicated section designed for collecting feedback.",
                      "If you wish to share your valuable feedback with us, please visit our SaveNest website. You'll find a dedicated section there specifically for collecting feedback from users.",
                      "To offer your valuable feedback, please head over to our SaveNest website. We've created a special section there specifically for gathering feedback from users like yourself.",
                      "If you'd like to provide your valuable feedback, please visit our SaveNest website. You'll find a dedicated section there for collecting feedback from users.",
                      "For those who want to share their valuable feedback, we encourage you to visit our SaveNest website. You'll find a dedicated section there specifically for collecting feedback from users."
                    ]
      },
      {
        "tag": "chatbot",
        "patterns": [
                      "Are you human? / Are you a robot?",
                      "Am I talking to a real person or a bot?",
                      "Are you automated or a real person?",
                      "Is this conversation with a human or a machine?",
                      "Can you confirm if you're a human or a bot?",
                      "Are you a robot or a person?",
                      "Is this a chat with an AI or a human?",
                      "Can you verify if you're a bot or a human?",
                      "Am I interacting with a machine or a person?",
                      "Are you automated or manually responding?",
                      "Can you clarify if you're AI-driven or human-driven?",
                      "Is there a human behind these responses?",
                      "How do I know if you're a bot or a human?",
                      "Can you disclose if you're an AI?",
                      "Is this conversation being handled by a robot?",
                      "Are these responses generated by a computer?",
                      "Can you confirm if you're a chatbot?",
                      "Are you a virtual assistant or a person?",
                      "Is this a scripted response or a genuine conversation?",
                      "Is there a person reading my messages or an algorithm?",
                      "Can you tell me if you're a bot?",
                      "Are you a machine or a human?",
                      "Is there a person on the other end or a program?",
                      "Can you confirm if you're automated?",
                      "Are these replies generated automatically?",
                      "Is there an AI responding to me?",
                      "How do I know if I'm chatting with a machine?",
                      "Can you disclose if this conversation is AI-driven?",
                      "Is there a real person behind these messages?",
                      "Can you clarify if you're an automated system?",
                      "Are these responses pre-programmed?",
                      "Is this conversation controlled by an algorithm?",
                      "Can you verify if you're a chatbot or a person?",
                      "Are you a bot or a live agent?",
                      "Is there a human operator behind these responses?",
                      "How can I be sure if I'm speaking with a bot?",
                      "Can you confirm if you're a chatbot or an actual person?"
                    ],
        "responses": [ 
                      "Greetings! I'm the SaveNest chatbot, designed to assist you with any questions you may have about SaveNest.",
                      "Hello there! I'm the SaveNest chatbot, here to provide you with support and answers to any questions you might have about SaveNest.",
                      "Hi! I'm the SaveNest chatbot, crafted specifically to help address any inquiries you might have about SaveNest.",
                      "Hey there! I'm the SaveNest chatbot, ready to support you with any questions or concerns you may have regarding SaveNest.",
                      "Welcome! I'm the SaveNest chatbot, tailored to assist you with any queries you may have regarding SaveNest.",
                      "Good day! I'm the SaveNest chatbot, created to provide you with assistance and answers regarding SaveNest.",
                      "Hello there! I'm the SaveNest chatbot, designed to offer support and guidance regarding any questions you may have about SaveNest.",
                      "Hey! I'm the SaveNest chatbot, here to assist you with any inquiries or issues you might encounter while using SaveNest.",
                      "Hello! I'm the SaveNest chatbot, dedicated to providing you with assistance and information about SaveNest.",
                      "Greetings! I'm the SaveNest chatbot, at your service to help with any questions or concerns you might have about SaveNest."
                    ]
      },
      {
        "tag": "transaction_history",
        "patterns": [
                      "How do I view my transaction history?",
                      "How can I access my transaction history?",
                      "Where do I find my past transactions?",
                      "Is there a way to see my transaction history?",
                      "How do I check my financial transactions?",
                      "Where can I view my previous transactions?",
                      "Can you tell me how to see my transaction history?",
                      "What's the process for viewing my transaction history?",
                      "How do I review my transaction history?",
                      "Is there a section for transaction history?",
                      "How do I look up my transaction history?",
                      "Where do I go to see my spending history?",
                      "How can I see a list of my past transactions?",
                      "What steps do I take to view my transaction history?",
                      "Is there a feature to track my transaction history?",
                      "Where can I find details about my past transactions?",
                      "How do I access my payment history?",
                      "Is there a way to see my expense history?",
                      "Where do I find my transaction log?",
                      "Can you show me how to view my past transactions?",
                      "How do I retrieve my transaction history?",
                      "Where in the app can I find my transaction history?",
                      "How do I see my transaction log?",
                      "Is there a way to track my spending history?",
                      "How do I see my past purchases?",
                      "Where can I find my financial activity history?",
                      "Is there a tab for viewing my transaction history?",
                      "How do I find my previous transactions?",
                      "Where can I access my past transaction details?",
                      "Can you guide me on accessing my transaction history?",
                      "How do I see my account activity?",
                      "Where can I find a record of my past transactions?",
                      "How can I see my transaction record?",
                      "Is there a way to see my transaction summary?",
                      "How do I view my past payments?",
                      "Where can I check my transaction logs?",
                      "How do I find my past expenses?"
                    ],
        "responses": [
                      "Navigate to the expenses section within the application. You'll find a calendar there. By choosing a date from the calendar, you can view the transactions you've made on that particular day.",
                      "Head over to the expenses section of the application. Within this section, you'll notice a calendar feature. Simply select a date from the calendar to access the transactions you made on that specific day.",
                      "Access the expenses section of the application. You'll find a calendar displayed there. Upon selecting a date from the calendar, you'll be able to review the transactions you conducted on that chosen day.",
                      "Go to the expenses section of the application. There, you'll encounter a calendar feature. By picking a date from this calendar, you'll be able to view the transactions you've recorded for that day.",
                      "Visit the expenses section of the application. In this section, you'll discover a calendar. Selecting a date from the calendar will allow you to see the transactions you've completed on that particular day.",
                      "Navigate to the expenses section of the application. You'll find a calendar interface there. Simply choose a date from the calendar to access and review the transactions you've made on that date.",
                      "Access the expenses section within the application. Within this section, you'll come across a calendar. By selecting a date from the calendar, you can easily view the transactions made on that specific day.",
                      "Head over to the expenses section of the application. You'll notice a calendar feature there. Selecting a date from this calendar will enable you to see the transactions you've recorded for that day.",
                      "Go to the expenses section of the application. Within this section, you'll find a calendar displayed. By selecting a date from the calendar, you can conveniently review the transactions you've conducted on that particular day.",
                      "Visit the expenses section within the application. In this section, you'll encounter a calendar feature. Simply choose a date from the calendar to access and review the transactions made on that specific day."
                    ]
      },
      {
        "tag": "balance_update",
        "patterns": [
                      "When will my balance update after a transaction?", 
                      "How long does it take for my balance to update after a transaction?",
                      "When will my transaction be reflected in my balance?",
                      "Is there a delay before my balance updates after a transaction?",
                      "How soon can I expect my balance to reflect a transaction?",
                      "When should I expect my balance to update after making a transaction?",
                      "What is the processing time for updating my balance after a transaction?",
                      "How much time does it take for my transaction to show up in my balance?",
                      "When does the system update my balance after a transaction?",
                      "Is there a time frame for when my transaction will appear in my balance?",
                      "How quickly does the balance update after a transaction?",
                      "What is the usual waiting period for my balance to update?",
                      "When can I see my transaction reflected in my balance?",
                      "How soon after a transaction is my balance updated?",
                      "Is there a lag between making a transaction and updating my balance?",
                      "What is the typical processing time for updating balances?",
                      "How long does it typically take for transactions to appear in my balance?",
                      "When can I expect my recent transactions to affect my balance?",
                      "Is there a delay in updating my balance after transactions?",
                      "When does the system refresh my balance after transactions?",
                      "What is the turnaround time for updating balances after transactions?",
                      "How long should I wait for my balance to update after a transaction?",
                      "When will my transaction be reflected in my available balance?",
                      "How soon will my balance reflect recent transactions?",
                      "Is there a delay in updating my balance after making transactions?",
                      "When do transactions get processed and reflected in my balance?",
                      "What is the update frequency for balances after transactions?",
                      "When does my balance get recalculated after transactions?",
                      "How long until my balance is updated after completing a transaction?"
                    ],
        "responses": [
                      "As soon as you add the transaction, the balance will be updated instantly. There won't be any delay in the process.",
                      "The balance gets updated immediately after you add the transaction. There's no delay in the update.",
                      "Once the transaction is added, the balance will be promptly updated without any delay.",
                      "Adding the transaction will result in an immediate update of the balance. There's no delay in this process.",
                      "Right after adding the transaction, the balance is updated instantly. There's no delay whatsoever.",
                      "The balance will be updated immediately upon adding the transaction. There's no delay in the update process.",
                      "Once the transaction is added, the balance is updated without delay. It happens instantly.",
                      "Adding the transaction triggers an immediate update of the balance. There's no delay in this process.",
                      "Upon adding the transaction, the balance is promptly updated without any delay.",
                      "As soon as you add the transaction, the balance is updated instantly without any delay."
                    ]
      },
      {
        "tag": "account_security",
        "patterns": [ 
                      "Is my account information secure?",
                      "How is my personal information protected?",
                      "Do you share my data with third parties?",
                      "What measures do you take to prevent identity theft?",
                      "How secure is my account information?",
                      "What security measures are in place to protect my personal data?",
                      "Can I trust that my personal information is safe with this app?",
                      "What safeguards do you have to ensure the security of my data?",
                      "Is my data protected from unauthorized access?",
                      "How do you ensure the confidentiality of my account information?",
                      "What steps do you take to keep my personal information secure?",
                      "Are there security protocols in place to protect my data?",
                      "Can I rely on the security of this application?",
                      "What assurances do you provide regarding the security of my data?",
                      "How is my privacy maintained within this application?",
                      "Do you have security measures to prevent data breaches?",
                      "What security features are implemented to safeguard my information?",
                      "Can I be confident that my data won't be compromised?",
                      "Are there encryption methods used to protect my data?",
                      "How do you handle security threats to my personal information?",
                      "What steps are taken to prevent unauthorized access to my account?",
                      "Is my data encrypted while it's stored in your system?",
                      "How do you ensure the integrity of my personal data?",
                      "Can I be assured that my account is protected from cyber threats?",
                      "What measures are in place to prevent data loss?",
                      "Do you comply with industry standards for data security?",
                      "How do you address security vulnerabilities in your system?",
                      "Can I trust that my information won't be shared without my consent?",
                      "Are there procedures in place to detect and respond to security breaches?",
                      "What is your approach to protecting user privacy?",
                      "Is my data subject to any legal or regulatory protections?",
                      "How do you handle data retention and disposal securely?",
                      "Can I have confidence in the confidentiality of my account details?",
                      "What measures do you take to prevent unauthorized transactions?",
                      "Is my personal information stored securely?",
                      "How do you protect against identity theft?",
                      "Do you have measures to prevent data leaks?",
                      "What steps are taken to secure user authentication and access?",
                      "Can I trust that my data won't be sold or shared with third parties?"
                    ],
        "responses": [
                      "Your personal information is safeguarded using the latest technologies, ensuring that your data remains protected at all times. Under no circumstances will your data be shared with anyone.",
                      "We utilize state-of-the-art technologies to protect all of your personal information. Rest assured that your data is never shared with any third parties under any circumstances.",
                      "Using cutting-edge technologies, we ensure the protection of all your personal information. Your data is strictly confidential and will never be shared with anyone under any circumstances.",
                      "Your personal information is safeguarded with the most advanced technologies available. We guarantee that your data will not be shared with anyone under any circumstances.",
                      "All of your personal information is protected using the latest technologies. We prioritize the security of your data and ensure that it remains confidential, never shared with anyone under any circumstances.",
                      "We employ the latest technologies to protect your personal information, ensuring that it remains secure at all times. Your data is strictly confidential and will not be shared with anyone under any circumstances.",
                      "Your personal information is protected using the most advanced technologies available. You can trust that your data is kept confidential and will not be shared with anyone under any circumstances.",
                      "We use cutting-edge technologies to safeguard all of your personal information. Your data is kept private and will never be shared with anyone under any circumstances.",
                      "Your privacy is important to us, which is why we use the latest technologies to protect your personal information. Rest assured that your data is never shared with anyone under any circumstances.",
                      "Using the latest technologies, we ensure that all of your personal information is protected. Your data remains confidential and will not be shared with anyone under any circumstances."
                    ]
      },
      {
        "tag": "services",
        "patterns": [
                    "What services/features does your app offer?",
                    "Can you list the services/features provided by your app?",
                    "What functionalities does your app include?",
                    "What are the features available in your application?",
                    "Can you provide an overview of the services offered by your app?",
                    "What services does your app provide?",
                    "I'd like to know more about the features of your app.",
                    "Could you describe the functionalities of your application?",
                    "What options do I have within your app?",
                    "Can you tell me what your app is capable of doing?",
                    "What services are included in your app?",
                    "How does your app help users manage their finances?",
                    "What tools or utilities does your app offer?",
                    "Are there any special features in your application?",
                    "I'm interested in learning about the services your app offers.",
                    "Can you explain the different features of your app?",
                    "What services can I access through your application?",
                    "What features distinguish your app from others?",
                    "Can you give me a rundown of the features available in your app?",
                    "How does your app assist users with budget planning?",
                    "What functionalities are available for managing finances in your app?",
                    "Can you elaborate on the services provided by your app?",
                    "What services or tools are available for budget management in your app?",
                    "What features make your app suitable for budget planning?",
                    "Can you detail the services offered by your budget planning application?",
                    "What options do users have for financial management in your app?",
                    "Could you provide a description of the features included in your app?",
                    "How does your app support users in managing their expenses?",
                    "What features should I expect to find in your budget planning application?",
                    "Can you describe the capabilities of your app for financial planning?",
                    "What services are available to help users with budget tracking in your app?",
                    "How does your app aid users in setting financial goals?",
                    "What features does your app offer to help users save money?"
      ],
        "responses": [ 
                      "SaveNest provides unique and valuable features for your use, such as the OCR feature, which simplifies budget updating by allowing you to take a photo of your receipt. We also offer real-time alerts to notify you when you exceed your budget in any category or when the price of a selected product changes in the supermarket. Additionally, for those interested in stocks, we offer a stock market price prediction feature to provide a basic understanding of tomorrow's stock prices, including support for cryptocurrencies. Please note that these predictions are AI-generated and should be used for basic understanding purposes only.",
                      "At SaveNest, we offer unique and valuable features for your convenience. This includes the OCR feature, which enables you to update your budget effortlessly by taking a photo of your receipt. Additionally, we provide real-time alerts to notify you if you exceed your budget in any category or if the price of a selected product changes in the supermarket. Moreover, we offer a stock market price prediction feature for those interested in stocks and cryptocurrencies, providing insights into tomorrow's prices. Please keep in mind that these predictions are AI-generated and should be used for basic understanding purposes only.",
                      "In SaveNest, we provide unique and valuable features tailored to your needs. This includes the OCR feature, allowing you to update your budget simply by capturing a photo of your receipt. We also offer real-time alerts to notify you of any budget exceedances in a category or changes in supermarket prices for selected products. Additionally, for stock enthusiasts, we offer a stock market price prediction feature that extends to cryptocurrencies, offering insights into tomorrow's prices. Please be aware that these predictions are AI-generated and should be used for informational purposes only.",
                      "SaveNest offers unique and valuable features designed to enhance your experience. Our OCR feature allows you to update your budget seamlessly by snapping a photo of your receipt. Furthermore, we provide real-time alerts to notify you of any budget breaches in a category or changes in supermarket prices for selected items. Moreover, for those interested in stocks and cryptocurrencies, we offer a stock market price prediction feature to gain insights into tomorrow's prices. Please note that these predictions are AI-generated and should be used for informational purposes only.",
                      "At SaveNest, we provide unique and valuable features to elevate your financial management experience. Our OCR feature enables you to update your budget effortlessly by scanning your receipt. Additionally, we offer real-time alerts to notify you of any budget exceedances in a category or changes in supermarket prices for selected products. Furthermore, our stock market price prediction feature offers insights into tomorrow's prices for both stocks and cryptocurrencies, powered by AI-generated predictions. Please remember that these predictions are meant for informational purposes only.",
                      "In SaveNest, we offer a range of unique and valuable features to enhance your financial management. Our OCR feature simplifies budget updates by allowing you to photograph your receipts. We also provide real-time alerts for budget exceedances in categories or changes in supermarket prices. Additionally, our stock market price prediction feature provides insights into tomorrow's prices for stocks and cryptocurrencies, utilizing AI-generated predictions. Please use these predictions for informational purposes only.",
                      "At SaveNest, we provide you with unique and valuable features to improve your financial management. Our OCR feature makes budget updates easy by enabling you to upload receipts with a simple photo. Additionally, we offer real-time alerts for budget exceedances and changes in supermarket prices. Furthermore, our stock market price prediction feature offers insights into tomorrow's prices for stocks and cryptocurrencies, leveraging AI-generated predictions. Remember, these predictions are intended for informational purposes only.",
                      "SaveNest offers a variety of unique and valuable features to optimize your financial management. Our OCR feature streamlines budget updates by allowing you to scan receipts. We also provide real-time alerts for budget exceedances and changes in supermarket prices. Additionally, our stock market price prediction feature offers insights into tomorrow's prices for stocks and cryptocurrencies, utilizing AI-generated predictions. It's important to note that these predictions are for informational purposes only.",
                      "In SaveNest, we offer unique and valuable features designed to simplify your financial management. Our OCR feature allows you to update your budget effortlessly by capturing a photo of your receipt. We also provide real-time alerts for budget exceedances and changes in supermarket prices. Additionally, our stock market price prediction feature offers insights into tomorrow's prices for stocks and cryptocurrencies, utilizing AI-generated predictions. Please use these predictions responsibly for informational purposes only.",
                      "At SaveNest, we provide unique and valuable features to enhance your financial management experience. Our OCR feature enables easy budget updates through receipt scanning. We also offer real-time alerts for budget exceedances and changes in supermarket prices. Furthermore, our stock market price prediction feature offers insights into tomorrow's prices for stocks and cryptocurrencies, based on AI-generated predictions. Please remember to use these predictions for informational purposes only."
                    ]
      },
      {
        "tag": "notification",
        "patterns": [
                      "Can you guide me on setting up alerts or notifications?",
                      "How can I configure alerts or notifications in the app?",
                      "Is there a way to receive alerts or notifications?",
                      "What steps do I take to set up alerts or notifications?",
                      "How do I enable alerts or notifications?",
                      "Can you show me how to turn on alerts or notifications?",
                      "What options do I have for receiving alerts or notifications?",
                      "I'd like to know how to activate alerts or notifications.",
                      "How can I receive notifications about my budget?",
                      "How do I get alerts for overspending or budget limits?",
                      "What types of notifications can I set up in the app?",
                      "Is there a way to customize the alerts or notifications?",
                      "Can you explain the process of setting up alerts in detail?",
                      "What are the steps for configuring alerts or notifications?",
                      "What settings do I need to adjust to receive alerts or notifications?",
                      "How do I specify the criteria for receiving alerts or notifications?",
                      "Is there a feature for setting up alerts based on account activity?",
                      "How do I get notified about important financial updates?",
                      "What are the options for customizing alert preferences?",
                      "What steps do I take to ensure I receive timely notifications?"
                    ],
        "responses": [
                      "To customize your notifications, navigate to the settings menu. Within settings, select 'Push Notifications' to tailor your notification preferences.",
                      "Access the settings menu, then proceed to 'Push Notifications' where you can personalize your notification settings to your preference.",
                      "For customizing your notifications, head to the settings menu. From there, select 'Push Notifications' to adjust your notification preferences according to your liking.",
                      "To personalize your notifications, go to the settings menu and choose 'Push Notifications'. You can then customize your notification settings as per your preferences.",
                      "Navigate to the settings menu and select 'Push Notifications' to customize your notification preferences according to your needs.",
                      "For customizing your notifications, access the settings menu and select 'Push Notifications'. From there, you can tailor your notification settings to suit your preferences.",
                      "To adjust your notifications, go to the settings menu and select 'Push Notifications'. Here, you can customize your notification preferences according to your liking.",
                      "Head to the settings menu and choose 'Push Notifications' to personalize your notification settings according to your preferences.",
                      "To customize your notifications, access the settings menu and select 'Push Notifications'. From there, you can tailor your notification settings as per your liking.",
                      "For customizing your notifications, navigate to the settings menu and select 'Push Notifications'. You can then adjust your notification preferences according to your needs."
                    ]
      },
      {
        "tag": "investment_options",
        "patterns": [
                      "Are there investment options available in the app?",
                      "Do you provide investment opportunities?",
                      "Can I use the app for investment purposes?",
                      "Do you offer investment tools or services?",
                      "Are there investment functionalities in the app?",
                      "Can I explore investment opportunities within the app?",
                      "Is there a way to monitor investment performance?",
                      "Are there resources for investment research in the app?",
                      "Does the app offer tools for investment analysis?",
                      "Are there investment advisors or services available?",
                      "Does the app provide information on investment strategies?",
                      "Do you offer advice on investment decisions?",
                      "Are there features for monitoring investment returns?",
                      "Does the app offer resources for beginner investors?",
                      "Are there investment calculators or tools available?",
                      "Do you provide recommendations for investment opportunities?"
                    ],
        "responses": [ 
                      "At the moment, the app doesn't offer features for investing directly within it. However, there is a stock price prediction feature available for those interested in stocks and crypto. We're also planning to introduce new features in the future that will enable you to import your portfolio and manage your investments through the app.",
                      "Currently, the app doesn't have functionality for investing directly within it. Nonetheless, there's a stock price prediction feature for users interested in stocks and crypto. Additionally, we have plans to introduce new features in the future, including the ability to import your portfolio and manage investments through the app.",
                      "As of now, the app doesn't include features for investing directly within it. Nevertheless, there's a stock price prediction feature for users interested in stocks and crypto. We're also looking ahead to implement new features that will allow you to import your portfolio and manage investments through the app.",
                      "Presently, there aren't any features for investing within the app itself. However, there's a stock price prediction feature available for users interested in stocks and crypto. Moreover, we have plans to introduce new features in the future that will enable you to import your portfolio and manage investments directly through the app.",
                      "Currently, there are no features for investing directly within the app. Nonetheless, there's a stock price prediction feature for users interested in stocks and crypto. We're also working on introducing new features in the future that will enable you to import your portfolio and manage investments through the app.",
                      "At this time, the app doesn't provide features for investing directly within it. However, there's a stock price prediction feature for users interested in stocks and crypto. Furthermore, we have plans to introduce new features in the future that will allow you to import your portfolio and manage investments through the app.",
                      "As of now, the app doesn't offer features for investing directly within it. Nevertheless, there's a stock price prediction feature available for users interested in stocks and crypto. Additionally, we're planning to implement new features in the future that will enable you to import your portfolio and manage investments through the app.",
                      "Currently, there are no features within the app for investing directly. However, there's a stock price prediction feature for users interested in stocks and crypto. Moreover, we're planning to introduce new features in the future that will allow you to import your portfolio and manage investments through the app.",
                      "At the moment, the app doesn't include features for investing directly within it. Nonetheless, there's a stock price prediction feature for users interested in stocks and crypto. We're also planning to introduce new features in the future that will enable you to import your portfolio and manage investments through the app.",
                      "Presently, the app doesn't offer functionality for investing directly within it. However, there's a stock price prediction feature available for users interested in stocks and crypto. Furthermore, we have plans to introduce new features in the future that will allow you to import your portfolio and manage investments through the app."
                    ]
      },
      {
        "tag": "customer_support_hours",
        "patterns": [
                      "When is your customer support team available?",
                      "Can you provide information on your customer support hours?",
                      "What are the hours of operation for customer support?",
                      "What are your support team's working hours?",
                      "When can I reach your customer service team?",
                      "Are there specific times when I can contact customer support?",
                      "Can you tell me when I can get assistance from customer support?",
                      "What are the hours that customer service is available?",
                      "When is your support team reachable?",
                      "What are the support hours for your app?",
                      "Is there a particular time when I can reach out for support?",
                      "Can you specify the hours when I can contact customer service?",
                      "When are your support representatives on duty?",
                      "What hours can I expect customer support to be available?",
                      "When can I expect a response from your customer service team?",
                      "Are there specific times when I should contact customer support?",
                      "Can you provide the schedule for your customer support availability?",
                      "What are the operating hours for your support department?",
                      "When is the best time to contact your support team?",
                      "Can you inform me of the hours when I can receive assistance?",
                      "What times during the day can I reach out for help?",
                      "When are your support agents online?",
                      "Are there specific hours when I should expect a response from support?",
                      "Can you tell me when customer support is staffed?",
                      "When is your help desk available for assistance?",
                      "What are the hours when I can expect support to respond?",
                      "Is there a time frame when customer support is active?",
                      "When can I expect a reply from your support team?",
                      "Are there specific hours when I should avoid contacting customer support?",
                      "Can you provide the hours when I can expect support assistance?",
                      "When should I expect to receive help from your support team?",
                      "What times are your support agents available to assist?",
                      "Is there a preferred time to contact customer support?",
                      "Can you give me the hours when support is operational?"
                    ],
        "responses": [
                      "You can reach me anytime, day or night, as I'm available 24/7. Rest assured, our customer services team commits to responding to your message within 16 hours.",
                      "I'm here for you around the clock, 24/7. You can expect a response from our customer services team within 16 hours of sending your message.",
                      "You have access to assistance from me 24/7. Our customer services team guarantees a response to your message within 16 hours.",
                      "You can count on me to be available 24/7 for your inquiries. Our customer services team ensures that your message will receive a reply within 16 hours.",
                      "I'm at your service 24/7, ensuring support whenever you need it. Our customer services team pledges to respond to your message within 16 hours.",
                      "You're welcome to reach out to me anytime, as I'm here for you 24/7. Expect a response from our customer services team within 16 hours of your message.",
                      "Feel free to contact me anytime, day or night, as I'm available 24/7. Our customer services team commits to replying to your message within 16 hours.",
                      "I'm here to assist you 24/7, so don't hesitate to reach out. Our customer services team ensures that your message will receive a response within 16 hours.",
                      "You can reach out to me anytime, as I'm available 24/7. Our customer services team is dedicated to replying to your message within 16 hours.",
                      "Rest assured, I'm here for you 24/7. Our customer services team guarantees to reply to your message within 16 hours."
                    ]
      },
      {
        "tag": "expense_categorization",
        "patterns": [
                      "How can I categorize my expenses?",
                      "Can you explain how to categorize my expenses?",
                      "How do I classify my spending into different categories?",
                      "What options do I have for organizing my expenses?",
                      "How can I group my expenditures by category?",
                      "Can you provide instructions on categorizing expenses?",
                      "What steps do I take to label my spending?",
                      "Is there a way to assign categories to my expenses?",
                      "How do I sort my expenses into different categories?",
                      "Can you guide me through the process of categorizing expenses?",
                      "What are the methods for categorizing my spending?",
                      "How do I tag my expenses with categories?",
                      "Can you show me how to organize my expenses by category?",
                      "What are the criteria for categorizing expenses?",
                      "How can I segment my expenditures into distinct categories?",
                      "Can you demonstrate how to classify expenses?",
                      "What are the best practices for categorizing expenses?",
                      "How do I allocate my spending to different categories?",
                      "Can you explain the concept of expense categorization?",
                      "What are the benefits of categorizing my expenses?",
                      "How do I differentiate between different expense categories?",
                      "Can you provide examples of expense categories?",
                      "How do I create custom categories for my expenses?",
                      "Is there a predefined list of expense categories?",
                      "What criteria should I use to assign categories to my expenses?",
                      "How do I manage and update expense categories?",
                      "Can you help me understand the importance of categorizing expenses?",
                      "What are the common expense categories used in budget planning?",
                      "How do I ensure accurate categorization of my expenses?",
                      "Can you provide tips for effectively categorizing expenses?"
                    ],
        "responses": [ 
                      "To categorize purchases, you have the option to do so manually by navigating to the add section. Alternatively, you can simply upload the receipt, and the app will automatically categorize the purchases for you.",
                      "You have two options for categorizing purchases: manually through the add section or automatically by uploading the receipt, allowing the app to categorize them for you.",
                      "Categorizing purchases can be done in two ways: manually via the add section or automatically by uploading the receipt, which the app will then categorize for you.",
                      "For categorizing purchases, you can choose between manual categorization through the add section or automatic categorization by uploading the receipt, which the app will handle for you.",
                      "You can categorize purchases manually by using the add section, or you can streamline the process by uploading the receipt and letting the app categorize the purchases automatically for you.",
                      "Categorizing purchases can be done manually by navigating to the add section, or you can opt for automatic categorization by simply uploading the receipt.",
                      "To categorize purchases, you can either manually categorize them through the add section or let the app automatically categorize them for you by uploading the receipt.",
                      "You have the choice to categorize purchases manually by accessing the add section, or you can choose automatic categorization by uploading the receipt.",
                      "To categorize purchases, you can manually categorize them through the add section, or you can allow the app to categorize them automatically by uploading the receipt.",
                      "Categorizing purchases is simple: manually categorize them via the add section, or opt for automatic categorization by uploading the receipt."
                    ]
      },
      {
        "tag": "spending_habits",
        "patterns": [
                      "Is there a way to track my spending habits?",
                      "Can I monitor my spending habits?",
                      "How can I track my spending patterns?",
                      "Is there a feature for analyzing my spending habits?",
                      "Can you help me understand my spending behavior?",
                      "What tools do you offer for tracking my spending habits?",
                      "How do I keep track of my spending tendencies?",
                      "Is there a way to assess my spending habits?",
                      "Can I get insights into my spending behavior?",
                      "How do I evaluate my financial habits?",
                      "What methods are available for monitoring my spending habits?",
                      "Can you show me how to review my spending patterns?",
                      "Is there a function to analyze my expenditure trends?",
                      "How can I keep a record of my spending habits?",
                      "Can I see a breakdown of my spending habits?",
                      "What resources are available for analyzing my spending habits?",
                      "How do I assess my spending trends over time?",
                      "Is there a tool for tracking my financial habits?",
                      "Can you assist me in understanding my spending habits?",
                      "How do I gain insights into my spending habits?",
                      "What features are available for tracking my spending tendencies?",
                      "Is there a way to monitor my expenses and habits?",
                      "Can I receive reports on my spending behavior?",
                      "How do I track my spending patterns over time?",
                      "Is there a feature to help me identify my spending trends?",
                      "Can I view statistics on my spending habits?",
                      "How do I analyze my spending habits to make changes?",
                      "Is there a way to visualize my spending habits?",
                      "Is there a tool to help me understand my spending patterns?"
                    ],
        "responses": [
                      "To view your spending habits, navigate to the reports section of the app.",
                      "You can easily check your spending habits by accessing the reports section within the app.",
                      "For an overview of your spending habits, simply visit the reports section of the app.",
                      "To see your spending habits, head over to the reports section available in the app.",
                      "Access the reports section of the app to get insights into your spending habits effortlessly.",
                      "To monitor your spending habits, go to the reports section within the app.",
                      "For insights into your spending habits, go to the reports section of the app.",
                      "Viewing your spending habits is as simple as going to the reports section in the app.",
                      "To track your spending habits, visit the reports section of the app.",
                      "By going to the reports section of the app, you can easily observe your spending habits."
                    ]
      },
      {
        "tag": "exceeding_budget",
        "patterns": [
                      "Can I receive alerts if I exceed my budget?",
                      "Is it possible to get alerts when I exceed my budget?",
                      "Can the app notify me if I go over my budget?",
                      "Can I receive notifications if my spending exceeds the budget?",
                      "Is there a feature to alert me when I go beyond my budget?",
                      "Can I get warnings if I overspend my budget?",
                      "Are there options for receiving alerts if I exceed my spending limit?",
                      "How can I receive alerts for exceeding my budget?",
                      "Is there a way for the app to notify me if I exceed my budget?",
                      "Can the app warn me when my spending exceeds the budget?",
                      "Are there options to receive notifications for surpassing budget thresholds?",
                      "Is there a feature to monitor and notify me of budget overruns?",
                      "Can I receive warnings if I exceed my budget?",
                      "Are there settings for receiving notifications about exceeding budget targets?",
                      "Is there a way to receive alerts when my spending exceeds the budget?",
                      "Can I receive notifications when I go over my allocated budget?",
                      "Can I receive notifications for budget breaches?"
                    ],
        "responses": [
                      "Enabling the alerts feature will result in the app sending you real-time notifications whenever you exceed your budget allocation.",
                      "By activating the alerts feature, the app will send you immediate notifications if you surpass your allocated budget.",
                      "When you activate the alerts feature, the app will promptly notify you in real-time if you exceed your set budget.",
                      "Once you enable the alerts feature, expect to receive real-time notifications from the app whenever you exceed your budget allocation.",
                      "By turning on the alerts feature, the app will send you instant notifications whenever you go over your budget.",
                      "Enabling the alerts feature ensures that the app sends you real-time notifications whenever you exceed your allocated budget.",
                      "When you enable the alerts feature, the app will send you real-time notifications whenever you exceed your budget limit.",
                      "Activating the alerts feature will prompt the app to send you real-time notifications whenever you exceed your allocated budget.",
                      "If you enable the alerts feature, the app will send you immediate notifications whenever you exceed your budget allocation.",
                      "When the alerts feature is turned on, the app will send you real-time notifications if you exceed your allocated budget."
                    ]
      },
      {
        "tag": "account_deletion",
        "patterns":  [
                        "How do I close my account?",
                        "Can you guide me on closing my account?",
                        "How do I terminate my account?",
                        "Is there a process for closing my account?",
                        "Can you explain how to deactivate my account?",
                        "What steps do I take to close my account?",
                        "How can I cancel my account?",
                        "Is it possible to close my account permanently?",
                        "How do I end my membership?",
                        "What is the procedure for account closure?",
                        "Can you assist me in closing my account?",
                        "How do I remove my account from the system?",
                        "Is there a way to disable my account?",
                        "Can you provide instructions for account closure?",
                        "What are the steps for account termination?",
                        "How can I close my profile?",
                        "Is there an option to delete my account?",
                        "Can you show me how to close my user account?",
                        "How do I permanently shut down my account?",
                        "Is there a way to cancel my membership?",
                        "Can I deactivate my account myself?",
                        "How do I unregister from the service?",
                        "What do I need to do to close my account?",
                        "Is there a way to remove my account from the platform?",
                        "Can you explain the process of account deactivation?",
                        "How can I withdraw from the platform?",
                        "What are the requirements for closing my account?",
                        "Can I cancel my account online?",
                        "Is it possible to close my account via the app?",
                        "How do I cease my account access?",
                        "What is the policy for closing accounts?",
                        "Can you provide details on account closure?",
                        "How do I initiate the account closure process?"
                      ],
        "responses": [
                      "To delete your account, navigate to the settings, then proceed to the profile section. Select the last option within the profile section. The app will prompt you to enter your username and password. Upon verifying your credentials, you'll be able to delete the account.",
                      "If you wish to delete your account, go to settings, then access the profile section. Choose the final option listed in the profile section. You'll then be required to input your username and password for verification. Once confirmed, you can proceed to delete the account.",
                      "For account deletion, access settings, then go to the profile section. From there, select the last option available. Next, you'll be prompted to provide your username and password. After successful verification, you can proceed to delete the account.",
                      "To delete your account, simply navigate to settings, then proceed to the profile section. Choose the last option provided within the profile section. The app will request your username and password for authentication. Upon successful verification, you can proceed to delete the account.",
                      "If you want to delete your account, head to settings, then go to the profile section. Select the last option available in the profile section. You'll then be prompted to enter your username and password. After confirming your credentials, you can proceed to delete the account.",
                      "For deleting your account, go to settings, then access the profile section. Choose the final option listed within the profile section. You'll be prompted to input your username and password for verification purposes. After successful verification, you can delete the account.",
                      "To delete your account, access settings, then proceed to the profile section. Select the last option provided in the profile section. The app will then prompt you to enter your username and password. Upon successful verification, you can proceed with deleting the account.",
                      "If you wish to delete your account, navigate to settings, then go to the profile section. Choose the last option available within the profile section. You'll be required to provide your username and password for verification. Once verified, you can proceed to delete the account.",
                      "For deleting the account, go to settings, then access the profile section. Select the last option available in the profile section. You'll then need to input your username and password for authentication. After successful verification, you can delete the account.",
                      "To delete your account, access settings, then proceed to the profile section. Choose the last option provided within the profile section. The app will ask for your username and password. Upon verification, you can proceed to delete the account."
                    ]
      },
      {
        "tag": "account_reopening",
        "patterns": [
                        "Can I reopen a closed account?",
                        "Is it possible to reopen a closed account?",
                        "Can I restore my closed account?",
                        "How do I reactivate a closed account?",
                        "Can you guide me on reopening my account?",
                        "Is there a way to regain access to a closed account?",
                        "Can I recover my account after it's been closed?",
                        "What steps do I take to reopen a closed account?",
                        "How can I undo the closure of my account?",
                        "Is it feasible to reopen my previously closed account?",
                        "Can you assist me in restoring my closed account?",
                        "What is the process for reopening an account that was closed?",
                        "How do I reinstate my account that has been closed?",
                        "Is there a timeframe within which I can reopen a closed account?",
                        "Can I request to reopen my account?",
                        "How can I regain access to my account that was closed?",
                        "Is there a way to reactivate my account if it's been closed?",
                        "Can I retrieve my data if I reopen a closed account?",
                        "Is it possible to reopen my account with the same information?",
                        "What are the conditions for reopening a closed account?",
                        "Can I reopen my account without losing my data?",
                        "How do I go about reopening my account if it's been closed?",
                        "Is there a fee associated with reopening a closed account?",
                        "Can I reopen my account using the same login credentials?",
                        "Is there a waiting period before I can reopen a closed account?",
                        "How long after closure can I still reopen my account?",
                        "Can I reopen my account if I accidentally closed it?",
                        "What happens to my account information if I reopen a closed account?",
                        "How can I check if my closed account can be reopened?",
                        "Is there a limit on how many times I can reopen a closed account?",
                        "Can I reopen my account if it was closed due to inactivity?",
                        "How do I know if my account is eligible for reopening?"
                      ],
        "responses": [
                      "Once your account is deleted, it cannot be recovered. However, you have the option to create a new account using the same credentials as before.",
                      "After deleting your account, it cannot be restored. Nonetheless, you can create a new account using the same credentials as previously used.",
                      "If you delete your account, it will be permanently removed, and there's no way to recover it. Nevertheless, you can create a new account using the same credentials.",
                      "Once you've deleted your account, it's gone for good and cannot be restored. But don't worry, you can always create a new account using the same credentials.",
                      "After deleting your account, it cannot be retrieved. However, you can always create a new account using the same credentials as before.",
                      "Once your account has been deleted, it cannot be recovered. Nonetheless, you have the option to create a new account using the same credentials as previously used.",
                      "If you choose to delete your account, it will be permanently erased, and you won't be able to recover it. Nonetheless, you can register for a new account using the same credentials.",
                      "After deleting your account, it cannot be restored. Nevertheless, you have the option to set up a new account using the same credentials as before.",
                      "Once your account is deleted, it cannot be restored. However, you can create a new account using the same credentials as previously used.",
                      "If you delete your account, it will be permanently removed, and there's no way to recover it. However, you can always create a new account using the same credentials."
                    ]
      },
      {
        "tag": "currency_convertion",
        "patterns": [
                      "How do I convert currency within the app?",
                      "Can I convert currency within the app?",
                      "How do I change currencies in the app?",
                      "Is there a feature for currency conversion?",
                      "How can I convert currency in the application?",
                      "Can you explain how to switch currencies within the app?",
                      "What steps do I take to convert currency in the app?",
                      "Is it possible to change currency denominations within the app?",
                      "Can I perform currency conversion using the app?",
                      "How do I switch between currencies in the app?",
                      "What options do I have for currency conversion within the app?",
                      "Can you guide me on converting currency in the app?",
                      "How does the app handle currency conversion?",
                      "Is there a currency conversion tool in the app?",
                      "Can I convert my spending data to a different currency?",
                      "How do I view my expenses in a different currency?",
                      "What is the process for converting currency in the app?",
                      "Can I see my budget in multiple currencies?",
                      "How do I change the currency display in the app?",
                      "Is there a way to see my spending in another currency?",
                      "Can you provide instructions for currency conversion in the app?",
                      "How do I switch the currency format in the app?",
                      "Can I convert my transactions to another currency?",
                      "How do I set a default currency for the app?",
                      "Is it possible to convert between currencies seamlessly in the app?",
                      "Can I view my budget in a different currency?",
                      "How can I change the currency symbol in the app?",
                      "What are the options for displaying currency in the app?",
                      "Is there a currency conversion feature available?",
                      "How do I update the currency exchange rates in the app?",
                      "Can I convert currency manually within the app?",
                      "How do I customize the currency settings in the app?"
                    ],
        "responses": [ 
                      "Currently, we do not have that feature available. However, we are in the process of developing a currency converting feature and aim to implement it in the next update.",
                      "At this time, the mentioned feature is not available. We are actively working on developing a currency converting feature and anticipate rolling it out in the next update.",
                      "As of now, the specified feature is not included. Our team is working on developing a currency converting feature, which is planned to be implemented in the next update.",
                      "That particular feature is not yet available in our app. We're currently working on developing a currency converting feature and intend to release it in the next update.",
                      "We currently do not offer that feature. However, we're in the process of developing a currency converting feature and expect to introduce it in the next update.",
                      "As of now, the feature you mentioned is not part of our app. We're actively developing a currency converting feature and have plans to incorporate it in the next update.",
                      "Unfortunately, that feature is not available at the moment. We're working hard on developing a currency converting feature and plan to include it in the next update.",
                      "We regret to inform you that the mentioned feature is not currently available. However, we're in the midst of developing a currency converting feature and intend to launch it in the next update.",
                      "At present, the feature you're asking about is not yet implemented. We're currently in the development stage of a currency converting feature and expect it to be available in the next update.",
                      "The feature you're referring to is not available in our app right now. We're actively developing a currency converting feature and aim to introduce it in the next update."
                    ]
      },
      {
        "tag": "future_updates",
        "patterns": [
                      "Are there any upcoming features or updates to the app?",
                      "Can you tell me about any upcoming features or updates to the app?",
                      "Are there any new features or updates planned for the app?",
                      "What future updates or enhancements can I expect from the app?",
                      "Is there a roadmap for upcoming features in the app?",
                      "Can you provide information on future developments of the app?",
                      "How can I stay informed about upcoming features in the app?",
                      "Are there any announcements about upcoming features for the app?",
                      "What improvements are in the pipeline for the app?",
                      "Can I get a preview of upcoming features or updates to the app?",
                      "How often are new features added to the app?",
                      "Are there any sneak peeks available for upcoming features?",
                      "Is there a release schedule for upcoming updates?",
                      "What channels do you use to announce upcoming features?",
                      "How do I know if a feature I'm interested in will be added to the app?",
                      "Are there any new functionalities planned for the app?",
                      "Do you have a roadmap for future development of the app?",
                      "Where can I find information about upcoming features?",
                      "How do you decide which features to include in future updates?",
                      "Are there any major changes expected in future updates?",
                      "What are the timelines for upcoming updates or features?"
                    ],
        "responses": [
                      "To stay informed about our upcoming updates, visit our website where you'll find details about all the upcoming features in the next patch. These updates will be available on our website a week before the update.",
                      "For information about our future updates, visit our website. All upcoming features in the next patch will be listed there, accessible a week before the update.",
                      "If you want to know about our future updates, check our website. You'll find information about all the upcoming features in the next patch there, available a week before the update.",
                      "To stay updated on our future updates, check out our website. You'll find details about all the upcoming features in the next patch there, provided a week before the update.",
                      "For information about our upcoming updates, visit our website. All upcoming features in the next patch will be listed there, accessible one week prior to the update.",
                      "To find out about our future updates, visit our website. All upcoming features in the next patch will be available there one week before the update.",
                      "If you're interested in learning about our future updates, visit our website. You'll find details about all the upcoming features in the next patch, available one week before the update.",
                      "To get updates on our future releases, visit our website. All upcoming features in the next patch will be detailed there, available a week before the update.",
                      "For details on our future updates, check out our website. All upcoming features in the next patch will be listed there, accessible one week before the update.",
                      "To stay informed about our future updates, browse our website. All upcoming features in the next patch will be available there one week before the update."
                    ]
      },
      {
        "tag": "complaints",
        "patterns": [
                      "What is the process for filing a complaint?",
                      "Is there a procedure for submitting complaints?",
                      "Can you explain the process for lodging a complaint?",
                      "What steps do I take to report an issue or file a complaint?",
                      "Is there a designated way to file complaints in the app?",
                      "How can I register a complaint about the app?",
                      "Can you guide me through the process of filing a complaint?",
                      "What is the protocol for raising complaints about the app?",
                      "Is there a support channel specifically for filing complaints?",
                      "How do I escalate an issue or file a formal complaint?",
                      "Are there specific channels for submitting complaints?",
                      "What information do I need to include when filing a complaint?",
                      "Is there a customer service department dedicated to handling complaints?",
                      "Are there any guidelines for filing complaints about the app?",
                      "Can I expect a response after filing a complaint?",
                      "Is there a support team available to assist with filing complaints?",
                      "What measures are in place to ensure complaints are resolved?",
                      "Are there any limitations on the types of complaints that can be filed?"
                    ],
        "responses": [ 
                      "If you have any complaints about the app, you can submit them through the 'Contact Us' section or by using the contact information provided on our website.",
                      "To file complaints about the app, you can utilize the 'Contact Us' section or contact us directly using the information available on our website.",
                      "If you wish to lodge complaints about the app, you have the option to do so through the 'Contact Us' section or by reaching out to us via the contact information listed on our website.",
                      "For submitting complaints about the app, you can access the 'Contact Us' section or reach out to us using the contact details provided on our website.",
                      "To send your complaints regarding the app, you can use the 'Contact Us' section or contact us directly through the information available on our website.",
                      "If you need to voice your complaints about the app, you can do so via the 'Contact Us' section or by reaching out to us using the contact information provided on our website.",
                      "To register complaints about the app, you can utilize the 'Contact Us' section or contact us using the available contact information on our website.",
                      "If you want to submit complaints about the app, you can do so through the 'Contact Us' section or by contacting us directly through the information provided on our website.",
                      "For sending complaints about the app, you have the option to use the 'Contact Us' section or reach out to us using the contact details provided on our website.",
                      "To share your complaints about the app, you can access the 'Contact Us' section or contact us directly through the information available on our website."
                    ]
      },
      {
        "tag": "survey",
        "patterns": [
                      "Is there a satisfaction survey I can participate in?",
                      "How can I participate in a satisfaction survey?",
                      "Is there a survey available for user feedback?",
                      "Can you tell me about any satisfaction surveys?",
                      "How do I provide feedback through a satisfaction survey?",
                      "Is there a way to share my experience through a survey?",
                      "Can I take part in a survey to provide feedback?",
                      "Where can I find the satisfaction survey?",
                      "Is there a feedback form or survey I can fill out?",
                      "How do I access the satisfaction survey?",
                      "Can you guide me on participating in a satisfaction survey?",
                      "Is there an opportunity to participate in a user satisfaction survey?",
                      "What is the process for taking the satisfaction survey?",
                      "Where can I find the survey to rate my experience?",
                      "How often are satisfaction surveys available?",
                      "Can I give my opinion through a survey?",
                      "Is there a customer feedback survey available?",
                      "How can I share my thoughts through a survey?",
                      "Where can I provide input through a satisfaction survey?",
                      "Are there any ongoing satisfaction surveys?",
                      "How do I know if there is a satisfaction survey available?",
                      "Can you provide a link to the satisfaction survey?",
                      "Is there a way to rate my satisfaction with the app?",
                      "What questions are asked in the satisfaction survey?",
                      "How long does it take to complete the satisfaction survey?",
                      "Can I participate in the satisfaction survey anonymously?",
                      "Is there a survey to evaluate user experience?",
                      "What types of feedback are collected in the satisfaction survey?"
                    ],
        "responses": [
                      "Every week, we'll conduct a survey, and by participating in these surveys, you may have the opportunity to join our beta testing programs for upcoming updates.",
                      "Once a week, we'll administer a survey, and by taking part in these surveys, you could potentially qualify for enrollment in our beta testing programs for forthcoming updates.",
                      "On a weekly basis, we'll run surveys, and your participation in these surveys might grant you access to our beta testing programs for upcoming updates.",
                      "There's a weekly survey, and by participating in it, you might be eligible to join our beta testing programs for future updates.",
                      "Each week, we'll host a survey, and participating in these surveys may allow you to become part of our beta testing programs for upcoming updates.",
                      "Once a week, we'll conduct a survey, and if you participate, you may have the opportunity to join our beta testing programs for future updates.",
                      "Every week, we'll launch a survey, and by taking part in these surveys, you might be selected to join our beta testing programs for upcoming updates.",
                      "There's a survey scheduled once every week, and participating in these surveys could potentially qualify you for our beta testing programs for future updates.",
                      "Weekly surveys will be conducted, and your participation in these surveys could grant you the chance to sign up for our beta testing programs for upcoming updates.",
                      "We'll have a survey every week, and participating in these surveys might give you the opportunity to enroll in our beta testing programs for future updates."
                    ]
      },{
        "tag": "fallback",
        "patterns": [
                      "tell me a joke",
                      "What is your name",
                      "Who made you",
                      "I like you",
                      "What are you?",
                      "I love you",
                      "I hate you",
                      "make me laugh",
                      "make me cry"],
        "responses": [
                      "Apologies! I'm a chat bot specifically created to address user inquiries about the application. Due to my design, I'm unable to respond to questions like this.",
                      "I'm sorry! As a chat bot designed to assist users with inquiries related to the application, I'm unable to answer questions of this nature.",
                      "My apologies! I'm here to answer questions users may have about the application. Unfortunately, I'm not equipped to respond to questions like this.",
                      "Sorry about that! My purpose is to provide assistance with questions related to the application. Therefore, I'm unable to address inquiries of this nature.",
                      "I apologize! My primary function is to respond to user queries regarding the application. Consequently, I'm unable to provide answers to questions like this.",
                      "Sorry for any inconvenience! I'm designed to help users with questions related to the application. Unfortunately, I'm not capable of answering questions like this.",
                      "Apologies for the inconvenience! My role is to assist users with inquiries concerning the application. Hence, I'm unable to address questions like this.",
                      "I'm sorry, but my function is to respond to user queries about the application. Therefore, I'm unable to provide answers to questions of this nature.",
                      "I apologize, but my purpose is to assist users with questions related to the application. As such, I'm not equipped to respond to inquiries like this.",
                      "Sorry, I'm designed to answer questions users may have about the application. Consequently, I'm unable to address questions of this nature."
                    ]
        }
    ]
}