{
    "intents": [
      {
        "tag": "greeting",
        "patterns": [
                      "Hello", 
                      "Hi",
                      "Hey",
                      "Good day",
                      "Greetings",
                      "What's up?",
                      "Yo",
                      "Hi there",
                      "Good morning",
                      "Good afternoon",
                      "What's up",
                      "Howdy",
                      "Hiya",
                      "Hey there",
                      "Hello there",
                      "Hi, can I get some help?",
                      "Hello, may I ask a question?",
                      "Hi, I need assistance",
                      "Hey, could you help me?",
                      "Hello, I have a query",
                      "Hi, is anyone there?",
                      "Hey, is this support?"
                    ],
        "responses": [
                      "Hello!",
                      "Hi there!",
                      "Hey! How can I assist you?",
                      "Hey",
                      "Hey, what's up?",
                      "Hi! How can I be of service?",
                      "Greetings! How may I assist you today?",
                      "Hello there!","Hi! What can I do for you?",
                      "Hey! Need any help?",
                      "Welcome! How can I help you today?",
                      "Hello, how may I be of assistance?",
                      "Hey there! What can I do to assist you?",
                      "Greetings! How may I help you?",
                      "Hi! How can I support you?",
                      "Hey! What brings you here?",
                      "Hello! How may I assist you?",
                      "Hi there! How can I be of service?",
                      "Hey! How can I assist you today?",
                      "Hello! What can I help you with?"
                      ]
      },
      {
        "tag": "goodbye",
        "patterns": [
                      "Goodbye", 
                      "See you later", 
                      "Bye",
                      "Cya",
                      "I am Leaving",
                      "Have a Good Day",
                      "Take care",
                      "Catch you later",
                      "Gotta go",
                      "Adios",
                      "Farewell",
                      "Until next time",
                      "So long",
                      "See you soon",
                      "Later",
                      "Till we meet again",
                      "Goodnight",
                      "Bye for now",
                      "Take it easy",
                      "Peace out",
                      "I'm off",
                      "Time to go",
                      "Signing off",
                      "Until later",
                      "Bye bye",
                      "I'll be back",
                      "Leaving now",
                      "Talk to you soon",
                      "Be well"
                    ],
        "responses": [
                      "Goodbye!", 
                      "See you later!", 
                      "Take care!",
                      "Farewell!",
                      "Until next time!",
                      "Have a great day!",
                      "Bye for now!",
                      "Take it easy!",
                      "Catch you later!",
                      "Adios!",
                      "Goodbye and take care!",
                      "See you soon!",
                      "Wishing you the best!"
                    ]
      },
      {
        "tag": "thanks",
        "patterns": [
                      "Thanks", 
                      "Thank you", 
                      "Appreciate it",
                      "Thankyou so much",
                      "Thanks it helped me fix the issue",
                      "Thank you very much",
                      "Many thanks",
                      "Much appreciated",
                      "Thanks a lot",
                      "Thanks a bunch",
                      "Thanks for your help",
                      "Thank you for assisting me",
                      "Thank you for your support",
                      "Thank you for the great service",
                      "Thank you for resolving my issue",
                      "I appreciate your help",
                      "I'm grateful for your assistance",
                      "You're awesome, thanks",
                      "I'm thankful for your support",
                      "You've been very helpful, thanks",
                      "I owe you one, thank you",
                      "I'm so grateful, thank you",
                      "I can't thank you enough",
                      "Thanks for everything",
                      "You're the best, thank you",
                      "Big thank you",
                      "Heartfelt thanks",
                      "Thanks a million",
                      "You've been fantastic, thank you",
                      "Thank you for being so helpful",
                      "I'm deeply grateful, thank you",
                      "You're a lifesaver, thank you",
                      "Thank you for going above and beyond",
                      "Thanks for being so responsive",
                      "Thanks for your prompt assistance"
                    ],
        "responses": [
                      "You're welcome!", 
                      "Glad I could help!", 
                      "No problem!",
                      "My pleasure!",
                      "Happy to assist!",
                      "Anytime!",
                      "It was my pleasure!",
                      "Glad to be of service!",
                      "Don't mention it!",
                      "Always here to help!",
                      "You're very welcome!",
                      "No trouble at all!",
                      "I'm here whenever you need!"
                    ]
      },
      {
        "tag": "savenest_app_do",
        "patterns": [
                      "What does savenest do?",
                      "What is this app for?",
                      "What can I do with this app?",
                      "What is the purpose of this app?",
                      "What problems does this app solve?",
                      "What benefits does this app offer?",
                      "How can this app assist me?",
                      "How does this app improve my life?",
                      "What can I expect from using this app?",
                      "What kind of data does this app manage?",
                      "What is the primary goal of this app?"
                    ],
        "responses": [
                        "Save Nest provides comprehensive finance management tools to help you track your income, expenses, and savings effectively.",
                        "Managing your finances is made easy with Save Nest, an application dedicated to tracking income, expenses, and savings.",
                        "Take control of your finances with Save Nest, a user-friendly app that assists in managing income, expenses, and savings.",
                        "With Save Nest, you can effortlessly monitor your finances, including income, expenses, and savings.",
                        "Stay on top of your financial health with Save Nest, an intuitive application designed to manage your income, expenses, and savings.",
                        "Save Nest simplifies financial management by allowing you to track your income, expenses, and savings in one convenient place.",
                        "Optimize your financial planning with Save Nest, a powerful tool for managing income, expenses, and savings.",
                        "Save Nest empowers you to efficiently manage your finances, ensuring you stay on track with your income, expenses, and savings.",
                        "Track your financial progress effortlessly with Save Nest, the ultimate solution for managing income, expenses, and savings.",
                        "Save Nest streamlines financial management tasks, offering insights into your income, expenses, and savings."
                      ]
      },
      {
        "tag": "password_reset",
        "patterns": [
                      "how do i change my password?",
                      "How can I update my password?",
                      "I forgot my password. How do I reset it?",
                      "What's the process for changing my password?",
                      "Can you guide me on changing my password?",
                      "Where do I go to change my password?",
                      "How do I set a new password?",
                      "Is there a way to modify my password?",
                      "I need to change my password. What should I do?",
                      "I want to update my password. How can I do that?",
                      "How do I edit my password?",
                      "What steps do I take to change my password?",
                      "Could you help me with resetting my password?",
                      "Where can I find the option to change my password?",
                      "What's the procedure for changing my account password?",
                      "Can you assist me in changing my password?",
                      "I need to change my login password. How do I proceed?",
                      "How do I access the password change feature?",
                      "I'm looking to change my password. Any guidance?",
                      "What's the method for changing my account password?",
                      "How do I update my login credentials?",
                      "What's the protocol for updating my password?",
                      "Do you have instructions for changing passwords?",
                      "Can you provide steps for changing my password?",
                      "I want to change my password. Where do I start?",
                      "How do I modify my login password?",
                      "What's the best way to change my password?",
                      "Where can I find the option to reset my password?"
                    ],
         "responses": [
                        "To initiate a password reset, navigate to your settings, access your profile, locate the password section, and follow the provided instructions. Don't hesitate to reach out if you require any additional help!",
                        "For resetting your password, simply head over to settings, proceed to your profile, locate the password option, and then follow the steps outlined there. If you encounter any issues, feel free to ask for assistance!",
                        "To reset your password, go to settings, then access your profile, find the password option, and proceed according to the instructions provided. If you have any questions or need further support, don't hesitate to reach out!",
                        "If you need to reset your password, go to settings, navigate to your profile, locate the password section, and follow the instructions provided. Feel free to ask if you require any additional assistance!",
                        "To reset your password, simply access settings, then proceed to your profile, locate the password option, and follow the instructions provided there. Should you require further assistance, don't hesitate to ask!",
                        "For password reset, head to settings, then your profile, locate the password section, and follow the steps provided. If you need more help, don't hesitate to ask!",
                        "To reset your password, go to settings, access your profile, find the password option, and follow the steps provided there. If you require any further assistance, feel free to reach out!",
                        "If you're looking to reset your password, navigate to settings, access your profile, locate the password section, and follow the instructions provided there. If you need additional support, just let us know!",
                        "For password reset, simply go to settings, access your profile, find the password section, and follow the steps provided. If you need any further assistance, we're here to help!",
                        "To reset your password, go to settings, then your profile, find the password section, and follow the instructions provided. Should you need any further assistance, don't hesitate to ask!"
                      ]
      },
      {
        "tag": "contacting_team",
        "patterns": [
                      "how to contact your team?",
                      "How can I reach your team?",
                      "What's the best way to get in touch with your team?",
                      "I need to contact your team. How do I do that?",
                      "Can you provide information on contacting your team?",
                      "How do I connect with your team?",
                      "I have a question. How do I contact support?",
                      "What are the contact options for your team?",
                      "Is there a way to speak with a member of your team?",
                      "How do I get assistance from your team?",
                      "How do I reach out to your customer support?",
                      "What's the process for reaching your team?",
                      "I want to talk to someone from your team. How do I do that?",
                      "Can you provide me with the contact details for your team?",
                      "I need help. How do I contact support?",
                      "What channels are available to contact your team?",
                      "How do I initiate contact with your team?",
                      "What are the available methods to contact your team?",
                      "I'm having an issue. How do I contact your team for help?",
                      "How do I get in touch with your support team?",
                      "I need assistance. How can I reach out to your team?",
                      "What's the procedure for contacting your team?",
                      "I want to speak with someone regarding an issue. How do I reach out?",
                      "Can you provide guidance on contacting your team?",
                      "I have a query. How do I contact your team?",
                      "How do I get support from your team?",
                      "What's the quickest way to contact your team?",
                      "How do I access support from your team?",
                      "I need to talk to someone about a problem. How do I contact your team?"
                    ],
        "responses":[
                    "If you need to reach out to our team, you can find our contact information on our website and app under the 'About Us' section, or feel free to reach us via email or phone.",
                    "To get in touch with our team, you can refer to the 'About Us' section on our website or in the app, where you'll find our contact details. Alternatively, you can reach us via email or phone.",
                    "Should you wish to contact our team, you can find our contact details on our website, under the 'About Us' section, or within the app. You can also reach us via email or phone.",
                    "For any inquiries or assistance, you can contact our team through the email and phone numbers provided on our website and in the 'About Us' section of the app.",
                    "To get in touch with our team, simply visit our website and check out the 'About Us' section for our contact information, or you can find it within the app. You can also reach us by email or phone.",
                    "If you need assistance or have any questions, don't hesitate to contact our team. You can find our contact details on our website under the 'About Us' section or within the app. Alternatively, you can reach us via email or phone.",
                    "To reach our team, you can refer to the contact information provided on our website's 'About Us' section or within the app. You can also reach us via email or phone for any inquiries or assistance.",
                    "For any queries or assistance, you can reach out to our team through the contact details provided on our website under the 'About Us' section or within the app. You can also contact us via email or phone.",
                    "Should you need to get in touch with our team, you can find our contact information on our website's 'About Us' section or in the app. Feel free to reach out to us via email or phone for any assistance.",
                    "If you require assistance or wish to contact our team, you can find our contact information on our website's 'About Us' section or within the app. You can also reach us via email or phone."
                  ]
      },
      {
        "tag": "budget_creating",
        "patterns": [
                    "how to create a budget",
                    "Can you guide me on creating a budget?",
                    "I need help with budget creation. How do I start?",
                    "What's the process for making a budget?",
                    "How do I begin creating a budget?",
                    "Can you provide instructions on budget creation?",
                    "Where do I start with creating a budget?",
                    "I want to learn how to create a budget. How can I do that?",
                    "Is there a step-by-step guide for creating a budget?",
                    "How can I set up a budget?",
                    "I'm looking for advice on budget creation. What should I do?",
                    "How do I draft a budget?",
                    "What are the steps involved in budget creation?",
                    "Can you help me with budget planning?"
                  ],
        "responses": [
                      "Upon your initial sign-in to the application, you'll be prompted to create a budget. If you haven't created one yet, you'll also be prompted to do so when you navigate to the add section.",
                      "When you first log in to the app, you'll be asked to set up a budget. If you haven't done so already, you'll receive a prompt to create a budget when you access the add section.",
                      "When you sign in for the first time, the app will prompt you to establish a budget. If you haven't done this yet, you'll be reminded to create a budget when you visit the add section.",
                      "During your initial login to the application, you'll be requested to set up a budget. In case you haven't done this yet, you'll receive a prompt to create a budget upon entering the add section.",
                      "Upon your initial login to the app, you'll be guided to create a budget. If you haven't completed this step, you'll be reminded to do so when you enter the add section.",
                      "When you first access the app, you'll be guided through the process of setting up a budget. If you haven't done this yet, you'll be reminded to create a budget when you enter the add section.",
                      "During your first login to the application, you'll be prompted to create a budget. If you haven't completed this step, you'll receive a reminder to create a budget when you visit the add section.",
                      "Upon your initial sign-in to the app, you'll be instructed to create a budget. If you haven't done so yet, you'll receive a reminder to create a budget when you navigate to the add section.",
                      "When you first sign in to the application, you'll be asked to establish a budget. If you haven't completed this step, you'll be reminded to create a budget when you access the add section.",
                      "During your initial sign-in to the app, you'll be prompted to create a budget. If you haven't done this yet, you'll receive a prompt to create a budget when you visit the add section."
                    ]
      },
      {
        "tag": "update_budget",
        "patterns": [
                      "how to update my budget",
                      "Can you guide me on updating my budget?",
                      "I need help with budget updates. How do I proceed?",
                      "What's the process for updating my budget?",
                      "How do I begin updating my budget?",
                      "Can you provide instructions on budget updates?",
                      "Where do I start with updating my budget?",
                      "I want to learn how to update my budget. How can I do that?",
                      "Is there a step-by-step guide for budget updates?",
                      "How can I modify my budget?",
                      "I'm looking for advice on budget updates. What should I do?",
                      "How do I adjust my budget?",
                      "What are the steps involved in updating a budget?",
                      "What's the best approach for updating my budget?",
                      "Can you help me with updating my budget?",
                      "How do I refine my budget?",
                      "I'm unsure how to start updating my budget. Can you assist?",
                      "How do I track changes to my budget?",
                      "Do you have any templates or examples for budget updates?",
                      "I want to learn more about updating my budget. Where should I begin?",
                      "Can you provide guidance on creating a personalized budget update?",
                      "How do I allocate funds effectively in an updated budget?"
                    ],
        "responses": [
                      "To update your budget manually, you can navigate to the 'Add' section in the application and select the items you wish to include. Alternatively, you can utilize our automatic feature, which employs OCR technology to update the budget automatically based on a photo of the receipt.",
                      "For manual budget updates, simply access the 'Add' section in the app and choose the items you'd like to add. Alternatively, you can take advantage of our automatic feature, which utilizes OCR technology to update the budget from a photo of the receipt.",
                      "If you prefer manual budget updates, you can do so by going to the 'Add' section within the application and selecting the items you want to include. Alternatively, you can opt for our automatic feature, which uses OCR technology to update the budget automatically from a receipt photo.",
                      "To manually update your budget, navigate to the 'Add' section in the application and select the desired items. Alternatively, you can opt for our automatic feature, which employs OCR technology to update the budget based on a photo of the receipt.",
                      "For manual budget updates, head to the 'Add' section in the application and choose the items you'd like to add to your budget. Alternatively, you can utilize our automatic feature, powered by OCR technology, to update the budget from a photo of the receipt.",
                      "If you want to update your budget manually, access the 'Add' section in the application and select the items you want to include. Alternatively, you can utilize our automatic feature, which leverages OCR technology to update the budget automatically from a photo of the receipt.",
                      "To manually update your budget, navigate to the 'Add' section in the app and select the items you'd like to add. Alternatively, you can take advantage of our automatic feature, which uses OCR technology to update the budget based on a photo of the receipt.",
                      "For manual budget updates, simply go to the 'Add' section in the application and choose the items you wish to include in your budget. Alternatively, you can use our automatic feature, powered by OCR technology, to update the budget from a photo of the receipt.",
                      "If you prefer manual budget updates, you can access the 'Add' section in the application and select the items you want to include. Alternatively, you can opt for our automatic feature, which utilizes OCR technology to update the budget automatically from a photo of the receipt.",
                      "To update your budget manually, you can go to the 'Add' section in the app and select the items you want to include. Alternatively, our automatic feature, which uses OCR technology, can update the budget from a photo of the receipt."
                    ]
      },
      {
        "tag": "delete_budget",
        "patterns": [
                      "how do i delete my budget",
                      "Can you guide me on deleting my budget?",
                      "I need help with budget deletion. How do I proceed?",
                      "What's the process for deleting my budget?",
                      "How do I begin deleting my budget?",
                      "Can you provide instructions on budget deletion?",
                      "Where do I start with deleting my budget?",
                      "I want to learn how to delete my budget. How can I do that?",
                      "Is there a step-by-step guide for budget deletion?",
                      "How can I remove my budget?",
                      "I'm looking for advice on budget deletion. What should I do?",
                      "How do I get rid of my budget?",
                      "What are the steps involved in deleting a budget?",
                      "What's the best approach for deleting my budget?",
                      "Can you help me with deleting my budget?",
                      "How do I erase my budget?",
                      "I'm interested in deleting my budget. What are the basics?",
                      "I'm unsure how to start deleting my budget. Can you assist?",
                      "What are the key components of successfully deleting a budget?",
                      "How do I confirm the deletion of my budget?",
                      "Do you have any templates or examples for budget deletion?",
                      "I want to learn more about deleting my budget. Where should I begin?",
                      "Can you provide guidance on deleting a personalized budget?"
                    ],
        "responses": [
                      "To remove a budget, navigate to the user section within the settings. There, you'll find an option labeled 'Delete Budget'.",
                      "If you wish to delete a budget, simply access the user section located in the settings. You'll then see an option specifically for deleting budgets.",
                      "To eliminate a budget, head to the user section in the settings. Look for the option labeled 'Delete Budget' to proceed.",
                      "If you want to delete a budget, go to the user section in the settings. From there, you'll find an option to delete the budget.",
                      "To delete a budget, access the user section in the settings. You'll see an option named 'Delete Budget' to help you remove it.",
                      "If you need to remove a budget, navigate to the user section within the settings. There, you'll find an option to delete the budget.",
                      "To delete a budget, go to the user section located in the settings. Look for the option titled 'Delete Budget' to proceed.",
                      "To eliminate a budget, simply access the user section within the settings. You'll then see an option specifically for deleting budgets.",
                      "If you wish to remove a budget, go to the user section in the settings. You'll find an option labeled 'Delete Budget' to assist you.",
                      "To delete a budget, access the user section in the settings. There, you'll see an option to delete the budget."
                    ]
      },
      {
        "tag": "account_details",
        "patterns": [
                      "how do i change my username",
                      "Can I change my account information",
                      "how do i change my email",
                      "How do I update my contact details?",
                      "How do I change my username?",
                      "Can I update my username?",
                      "How do I modify my account information?",
                      "How can I change my account details?",
                      "Can I change my personal information?",
                      "How do I edit my account information?",
                      "Can I change my profile details?",
                      "How do I update my user profile?",
                      "Is it possible to change my username?",
                      "How do I alter my account settings?",
                      "Can I update my account information?",
                      "How do I change my email address?",
                      "Is there a way to update my email?",
                      "Can I modify my email address?",
                      "How do I change my contact details?",
                      "Can I update my contact information?",
                      "How do I edit my email?",
                      "How can I change my email?",
                      "Is it possible to update my contact information?",
                      "How do I change my personal details?",
                      "Can I modify my account settings?",
                      "How do I update my user information?",
                      "Is there a way to change my account details?",
                      "How can I edit my account settings?"
                    ],
        "responses": [  
                      "If you wish to update your account information, simply navigate to the user section within the settings.",
                      "To modify your account details, go to the user section located in the settings.",
                      "For changing your account information, head over to the user section in the settings.",
                      "To update your account information, access the user section within the settings menu.",
                      "If you need to edit your account details, visit the user section available in the settings.",
                      "For altering your account information, navigate to the user section within the settings.",
                      "To adjust your account information, go to the user section found in the settings.",
                      "If you want to change your account details, access the user section in the settings.",
                      "To update your account information, simply go to the user section within the settings.",
                      "For modifying your account details, navigate to the user section located in the settings."
                    ]
      },
      {
        "tag": "app_price",
        "patterns": [
                      "How much does this app cost?",
                      "What is the pricing for this application?",
                      "Is there a fee for using this app?",
                      "Do I need to pay for this application?",
                      "What are the charges associated with this app?",
                      "Is there a subscription fee for this app?",
                      "What is the pricing model for this application?",
                      "Are there any costs associated with using this app?",
                      "Do I have to purchase this app?",
                      "Is this app available for free?",
                      "How expensive is this application?",
                      "What is the cost structure of this app?",
                      "Can you provide information on the pricing of this application?",
                      "Is there a one-time payment for this app?",
                      "How much do I need to pay to use this app?",
                      "Are there any hidden fees with this application?",
                      "What is the pricing plan for this app?",
                      "Does this app offer a free trial?",
                      "Is there a premium version of this app?",
                      "What payment methods are accepted for this app?",
                      "Are there any discounts available for this app?",
                      "Can I use this app for free forever?",
                      "Is there a monthly subscription for this app?",
                      "How can I get this app for free?",
                      "Is there a price tag associated with this application?",
                      "Can I test this app before purchasing?",
                      "Are there any in-app purchases in this app?",
                      "How do I pay for this app?",
                      "What is the cost of upgrading to a premium version?"
                    ],
        "responses": [
                      "Currently, there is no premium version available. Our application is completely free and offers all its features without any cost. However, we plan to introduce a premium version with additional functions in one of our upcoming updates.",
                      "At present, there isn't a premium version offered. Our application is entirely free, providing all its features to users without charge. We do intend to introduce a premium version with exclusive features in a future update.",
                      "As of now, there's no premium version of the application. It's free to use, offering all its features at no cost. However, we're planning to release a premium version with enhanced functionalities in an upcoming update.",
                      "Currently, there's no premium version available. Our application is free and offers all its features without any charges. However, we have plans to introduce a premium version with additional features in the near future.",
                      "For now, there's no premium version offered. Our application is completely free, providing all features to users without any cost. We do have plans to introduce a premium version with premium functions in a forthcoming update.",
                      "At the moment, there isn't a premium version available. Our application is free and offers all features without any fees. However, we're working on introducing a premium version with additional functions in the next update.",
                      "Currently, there's no premium version of the application. It's free to use, offering all features to users without any charges. However, we're preparing to release a premium version with advanced functionalities soon.",
                      "For now, there's no premium version available. Our application is free and provides all its features without any cost. However, we intend to introduce a premium version with premium functions in an upcoming update.",
                      "As of now, there's no premium version of the application. It's completely free, offering all features without any charges. However, we plan to introduce a premium version with additional functions in one of our future updates.",
                      "Currently, there's no premium version available. Our application is free and provides all its features for free. However, we'll be adding a premium version with premium functions in one of our upcoming updates."
                      ]
      },
      {
        "tag": "app_slow",
        "patterns": [
                      "application running slow",
                      "The app is very slow",
                      "Why is the application running so slowly?",
                      "The performance of the app is sluggish",
                      "The app is taking too long to respond",
                      "The application is not responding quickly",
                      "The app is lagging",
                      "Why does the app take so much time to load?",
                      "The application is freezing frequently",
                      "Why is the app not working smoothly?",
                      "The speed of the app is disappointing",
                      "The application is experiencing delays",
                      "Why is the app performance so poor?",
                      "The app is running at a snail's pace",
                      "The application is unresponsive",
                      "What's causing the app to be so slow?",
                      "The app is behaving sluggishly",
                      "The performance of the app is subpar",
                      "Why is the app response time so slow?",
                      "The app is not running smoothly",
                      "The application is taking forever to load",
                      "Why is the app performance degraded?",
                      "The app is running slower than usual",
                      "The application is not functioning optimally",
                      "The app is sluggish and unresponsive",
                      "The performance of the app has deteriorated",
                      "Why is the app performance inconsistent?",
                      "The application is experiencing delays and lags",
                      "The app is dragging its feet",
                      "The application is running poorly"
                    ],
        "responses": [
                      "At times, simply restarting the application can address performance issues by clearing temporary data and reloading the app. If that doesn't help, consider restarting your device to clear out temporary glitches or conflicts affecting performance. Make sure to keep the application updated, as low storage space can impact performance. Deleting unnecessary files or apps can free up space. Additionally, ensure your device's operating system is up to date, as updates may include performance improvements and bug fixes. If none of these solutions work, reaching out to the application's support team for personalized troubleshooting steps or further assistance may be necessary.",
                      "Sometimes, just restarting the application can solve performance issues by clearing temporary data and reloading the app. If that doesn't work, try restarting your device to resolve any temporary glitches or conflicts affecting performance. Keeping the application up to date is crucial, as low storage space can affect performance. Deleting unnecessary files or apps can help free up space. Also, make sure your device's operating system is up to date, as updates often include performance improvements and bug fixes. If none of these steps help, contacting the application's support team for personalized troubleshooting or further assistance may be needed.",
                      "Occasionally, simply restarting the application can resolve performance issues by clearing temporary data and reloading the app. If that doesn't work, try restarting your device to clear any temporary glitches or conflicts affecting performance. It's important to keep the application updated, as low storage space can impact performance. Deleting unnecessary files or apps can help free up space. Additionally, ensure your device's operating system is up to date, as updates may include performance improvements and bug fixes. If these steps don't resolve the issue, consider reaching out to the application's support team for personalized troubleshooting or further assistance.",
                      "In some cases, restarting the application can effectively address performance issues by clearing temporary data and reloading the app. If this doesn't help, consider restarting your device to clear temporary glitches or conflicts impacting performance. Keep the application updated to avoid performance issues caused by low storage space. Deleting unnecessary files or apps can also help free up space. Additionally, ensure your device's operating system is up to date, as updates may include performance enhancements and bug fixes. If none of these steps work, contacting the application's support team for personalized troubleshooting or further assistance may be necessary.",
                      "There are times when simply restarting the application can resolve performance issues by clearing temporary data and reloading the app. If this doesn't work, try restarting your device to clear temporary glitches or conflicts affecting performance. Keeping the application updated is important to prevent performance issues caused by low storage space. Deleting unnecessary files or apps can help free up space. Also, ensure your device's operating system is up to date, as updates may include performance improvements and bug fixes. If none of these solutions work, contacting the application's support team for personalized troubleshooting or further assistance may be necessary.",
                      "Sometimes, just restarting the application can solve performance issues by clearing temporary data and reloading the app. If this doesn't help, try restarting your device to clear temporary glitches or conflicts affecting performance. Ensure the application is kept up to date to avoid performance issues due to low storage space. Deleting unnecessary files or apps can also help free up space. Additionally, ensure your device's operating system is up to date, as updates may include performance improvements and bug fixes. If none of these steps resolve the issue, contacting the application's support team for personalized troubleshooting or further assistance may be required."
                    ]
      },
      {
        "tag": "feedback",
        "patterns": [
                      "how do i provide my feedback",
                      "Where can I leave my feedback?",
                      "How do I share my thoughts about the app?",
                      "Is there a way to provide feedback?",
                      "How can I give my input on the application?",
                      "I want to provide feedback. How do I do that?",
                      "What's the process for submitting feedback?",
                      "Can you tell me how to offer feedback?",
                      "How do I offer suggestions for improvement?",
                      "Where can I give my opinion about the app?",
                      "How do I send my feedback?",
                      "What's the best way to share my feedback?",
                      "How can I communicate my ideas for the app?",
                      "Is there a feedback form I can fill out?",
                      "I have some feedback. What should I do with it?",
                      "How do I provide comments on the app?",
                      "How do I express my satisfaction or concerns?",
                      "Can I give feedback directly through the app?",
                      "What channels are available for providing feedback?",
                      "I'd like to offer my feedback. How can I proceed?",
                      "Is there a way to report issues or suggest improvements?",
                      "Where should I go to share my experience with the app?",
                      "How do I offer constructive criticism?",
                      "Is there a feedback section in the app?",
                      "How can I give my feedback anonymously?",
                      "What's the procedure for giving feedback?",
                      "Is there a dedicated email address for feedback?",
                      "How do I contribute to the app's development?",
                      "What's the protocol for submitting feedback?",
                      "How do I voice my opinions about the app?"
                    ],
        "responses": [
                      "If you'd like to share your valuable feedback, you can do so by visiting our SaveNest website. We have a dedicated section designed specifically for collecting feedback from users like you.",
                      "To provide your valuable feedback, simply navigate to our SaveNest website. There, you'll find a dedicated section created specifically for gathering feedback from users.",
                      "For those who wish to offer their valuable feedback, we encourage you to visit our SaveNest website. You'll discover a dedicated section tailored for collecting feedback from users.",
                      "To share your valuable feedback, please visit our SaveNest website. We've created a specific section there for gathering feedback from users like yourself.",
                      "If you have valuable feedback to share, please visit our SaveNest website. We've set up a dedicated section specifically for collecting feedback from users.",
                      "For users who wish to provide their valuable feedback, we invite you to visit our SaveNest website. There, you'll find a dedicated section designed for collecting feedback.",
                      "If you wish to share your valuable feedback with us, please visit our SaveNest website. You'll find a dedicated section there specifically for collecting feedback from users.",
                      "To offer your valuable feedback, please head over to our SaveNest website. We've created a special section there specifically for gathering feedback from users like yourself.",
                      "If you'd like to provide your valuable feedback, please visit our SaveNest website. You'll find a dedicated section there for collecting feedback from users.",
                      "For those who want to share their valuable feedback, we encourage you to visit our SaveNest website. You'll find a dedicated section there specifically for collecting feedback from users."
                    ]
      },
      {
        "tag": "chatbot",
        "patterns": [
                      "Are you human? / Are you a robot?",
                      "Am I talking to a real person or a bot?",
                      "Are you automated or a real person?",
                      "Is this conversation with a human or a machine?",
                      "Can you confirm if you're a human or a bot?",
                      "Are you a robot or a person?",
                      "Is this a chat with an AI or a human?",
                      "Can you verify if you're a bot or a human?",
                      "Am I interacting with a machine or a person?",
                      "Are you automated or manually responding?",
                      "Can you clarify if you're AI-driven or human-driven?",
                      "Is there a human behind these responses?",
                      "How do I know if you're a bot or a human?",
                      "Can you disclose if you're an AI?",
                      "Is this conversation being handled by a robot?",
                      "Are these responses generated by a computer?",
                      "Can you confirm if you're a chatbot?",
                      "Are you a virtual assistant or a person?",
                      "Is this a scripted response or a genuine conversation?",
                      "Is there a person reading my messages or an algorithm?",
                      "Can you tell me if you're a bot?",
                      "Are you a machine or a human?",
                      "Is there a person on the other end or a program?",
                      "Can you confirm if you're automated?",
                      "Are these replies generated automatically?",
                      "Is there an AI responding to me?",
                      "How do I know if I'm chatting with a machine?",
                      "Can you disclose if this conversation is AI-driven?",
                      "Is there a real person behind these messages?",
                      "Can you clarify if you're an automated system?",
                      "Are these responses pre-programmed?",
                      "Is this conversation controlled by an algorithm?",
                      "Can you verify if you're a chatbot or a person?",
                      "Are you a bot or a live agent?",
                      "Is there a human operator behind these responses?",
                      "How can I be sure if I'm speaking with a bot?",
                      "Can you confirm if you're a chatbot or an actual person?"
                    ],
        "responses": [ 
                      "Greetings! I'm the SaveNest chatbot, designed to assist you with any questions you may have about SaveNest.",
                      "Hello there! I'm the SaveNest chatbot, here to provide you with support and answers to any questions you might have about SaveNest.",
                      "Hi! I'm the SaveNest chatbot, crafted specifically to help address any inquiries you might have about SaveNest.",
                      "Hey there! I'm the SaveNest chatbot, ready to support you with any questions or concerns you may have regarding SaveNest.",
                      "Welcome! I'm the SaveNest chatbot, tailored to assist you with any queries you may have regarding SaveNest.",
                      "Good day! I'm the SaveNest chatbot, created to provide you with assistance and answers regarding SaveNest.",
                      "Hello there! I'm the SaveNest chatbot, designed to offer support and guidance regarding any questions you may have about SaveNest.",
                      "Hey! I'm the SaveNest chatbot, here to assist you with any inquiries or issues you might encounter while using SaveNest.",
                      "Hello! I'm the SaveNest chatbot, dedicated to providing you with assistance and information about SaveNest.",
                      "Greetings! I'm the SaveNest chatbot, at your service to help with any questions or concerns you might have about SaveNest."
                    ]
      }
  

    ]
}